espressif/esp-idf/components/soc/esp32p4/include/soc/dspi_mem_reg.h
/*
 * SPDX-FileCopyrightText: 2017-2023 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#ifndef _SOC_DSPI_MEM_REG_H_
#define _SOC_DSPI_MEM_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"

#define DSPI_MEM_CMD_REG          (DR_REG_DSPI_MEM_BASE + 0x0)
/* DSPI_MEM_USR : HRO ;bitpos:[18] ;default: 1'b0 ; */
/*description: SPI0 USR_CMD start bit, only used when SPI_MEM_AXI_REQ_EN is cleared.  An operat
ion will be triggered when the bit is set. The bit will be cleared once the oper
ation done.1: enable 0: disable..*/
#define DSPI_MEM_USR    (BIT(18))
#define DSPI_MEM_USR_M  (BIT(18))
#define DSPI_MEM_USR_V  0x1
#define DSPI_MEM_USR_S  18
/* DSPI_MEM_SLV_ST : RO ;bitpos:[7:4] ;default: 4'b0 ; */
/*description: The current status of SPI0 slave FSM: mspi_st. 0: idle state, 1: preparation sta
te, 2: send command state, 3: send address state, 4: wait state, 5: read data st
ate, 6:write data state, 7: done state, 8: read data end state..*/
#define DSPI_MEM_SLV_ST    0x0000000F
#define DSPI_MEM_SLV_ST_M  ((DSPI_MEM_SLV_ST_V)<<(DSPI_MEM_SLV_ST_S))
#define DSPI_MEM_SLV_ST_V  0xF
#define DSPI_MEM_SLV_ST_S  4
/* DSPI_MEM_MST_ST : RO ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The current status of SPI0 master FSM: spi0_mst_st. 0: idle state, 1:SPI0_GRANT
, 2: program/erase suspend state, 3: SPI0 read data state, 4: wait cache/EDMA se
nt data is stored in SPI0 TX FIFO, 5: SPI0 write data state..*/
#define DSPI_MEM_MST_ST    0x0000000F
#define DSPI_MEM_MST_ST_M  ((DSPI_MEM_MST_ST_V)<<(DSPI_MEM_MST_ST_S))
#define DSPI_MEM_MST_ST_V  0xF
#define DSPI_MEM_MST_ST_S  0

#define DSPI_MEM_CTRL_REG          (DR_REG_DSPI_MEM_BASE + 0x8)
/* DSPI_MEM_DATA_IE_ALWAYS_ON : R/W ;bitpos:[31] ;default: 1'b1 ; */
/*description: When accesses to flash, 1: the IE signals of pads connected to SPI_IO[7:0] are a
lways 1. 0: Others..*/
#define DSPI_MEM_DATA_IE_ALWAYS_ON    (BIT(31))
#define DSPI_MEM_DATA_IE_ALWAYS_ON_M  (BIT(31))
#define DSPI_MEM_DATA_IE_ALWAYS_ON_V  0x1
#define DSPI_MEM_DATA_IE_ALWAYS_ON_S  31
/* DSPI_MEM_DQS_IE_ALWAYS_ON : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: When accesses to flash, 1: the IE signals of pads connected to SPI_DQS are alway
s 1. 0: Others..*/
#define DSPI_MEM_DQS_IE_ALWAYS_ON    (BIT(30))
#define DSPI_MEM_DQS_IE_ALWAYS_ON_M  (BIT(30))
#define DSPI_MEM_DQS_IE_ALWAYS_ON_V  0x1
#define DSPI_MEM_DQS_IE_ALWAYS_ON_S  30
/* DSPI_MEM_FREAD_QIO : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: In the read operations address phase and read-data phase apply 4 signals. 1: ena
ble 0: disable..*/
#define DSPI_MEM_FREAD_QIO    (BIT(24))
#define DSPI_MEM_FREAD_QIO_M  (BIT(24))
#define DSPI_MEM_FREAD_QIO_V  0x1
#define DSPI_MEM_FREAD_QIO_S  24
/* DSPI_MEM_FREAD_DIO : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: In the read operations address phase and read-data phase apply 2 signals. 1: ena
ble 0: disable..*/
#define DSPI_MEM_FREAD_DIO    (BIT(23))
#define DSPI_MEM_FREAD_DIO_M  (BIT(23))
#define DSPI_MEM_FREAD_DIO_V  0x1
#define DSPI_MEM_FREAD_DIO_S  23
/* DSPI_MEM_WP_REG : R/W ;bitpos:[21] ;default: 1'b1 ; */
/*description: Write protect signal output when SPI is idle.  1: output high, 0: output low..*/
#define DSPI_MEM_WP_REG    (BIT(21))
#define DSPI_MEM_WP_REG_M  (BIT(21))
#define DSPI_MEM_WP_REG_V  0x1
#define DSPI_MEM_WP_REG_S  21
/* DSPI_MEM_FREAD_QUAD : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: In the read operations read-data phase apply 4 signals. 1: enable 0: disable..*/
#define DSPI_MEM_FREAD_QUAD    (BIT(20))
#define DSPI_MEM_FREAD_QUAD_M  (BIT(20))
#define DSPI_MEM_FREAD_QUAD_V  0x1
#define DSPI_MEM_FREAD_QUAD_S  20
/* DSPI_MEM_D_POL : R/W ;bitpos:[19] ;default: 1'b1 ; */
/*description: The bit is used to set MOSI line polarity, 1: high 0, low.*/
#define DSPI_MEM_D_POL    (BIT(19))
#define DSPI_MEM_D_POL_M  (BIT(19))
#define DSPI_MEM_D_POL_V  0x1
#define DSPI_MEM_D_POL_S  19
/* DSPI_MEM_Q_POL : R/W ;bitpos:[18] ;default: 1'b1 ; */
/*description: The bit is used to set MISO line polarity, 1: high 0, low.*/
#define DSPI_MEM_Q_POL    (BIT(18))
#define DSPI_MEM_Q_POL_M  (BIT(18))
#define DSPI_MEM_Q_POL_V  0x1
#define DSPI_MEM_Q_POL_S  18
/* DSPI_MEM_FREAD_DUAL : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: In the read operations, read-data phase apply 2 signals. 1: enable 0: disable..*/
#define DSPI_MEM_FREAD_DUAL    (BIT(14))
#define DSPI_MEM_FREAD_DUAL_M  (BIT(14))
#define DSPI_MEM_FREAD_DUAL_V  0x1
#define DSPI_MEM_FREAD_DUAL_S  14
/* DSPI_MEM_FASTRD_MODE : R/W ;bitpos:[13] ;default: 1'b1 ; */
/*description: This bit enable the bits: SPI_MEM_FREAD_QIO, SPI_MEM_FREAD_DIO, SPI_MEM_FREAD_QO
UT and SPI_MEM_FREAD_DOUT. 1: enable 0: disable..*/
#define DSPI_MEM_FASTRD_MODE    (BIT(13))
#define DSPI_MEM_FASTRD_MODE_M  (BIT(13))
#define DSPI_MEM_FASTRD_MODE_V  0x1
#define DSPI_MEM_FASTRD_MODE_S  13
/* DSPI_MEM_FCMD_OCT : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: Apply 8 signals during command phase 1:enable 0: disable.*/
#define DSPI_MEM_FCMD_OCT    (BIT(9))
#define DSPI_MEM_FCMD_OCT_M  (BIT(9))
#define DSPI_MEM_FCMD_OCT_V  0x1
#define DSPI_MEM_FCMD_OCT_S  9
/* DSPI_MEM_FCMD_QUAD : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: Apply 4 signals during command phase 1:enable 0: disable.*/
#define DSPI_MEM_FCMD_QUAD    (BIT(8))
#define DSPI_MEM_FCMD_QUAD_M  (BIT(8))
#define DSPI_MEM_FCMD_QUAD_V  0x1
#define DSPI_MEM_FCMD_QUAD_S  8
/* DSPI_MEM_FADDR_OCT : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: Apply 8 signals during address phase 1:enable 0: disable.*/
#define DSPI_MEM_FADDR_OCT    (BIT(6))
#define DSPI_MEM_FADDR_OCT_M  (BIT(6))
#define DSPI_MEM_FADDR_OCT_V  0x1
#define DSPI_MEM_FADDR_OCT_S  6
/* DSPI_MEM_FDIN_OCT : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: Apply 8 signals during read-data phase 1:enable 0: disable.*/
#define DSPI_MEM_FDIN_OCT    (BIT(5))
#define DSPI_MEM_FDIN_OCT_M  (BIT(5))
#define DSPI_MEM_FDIN_OCT_V  0x1
#define DSPI_MEM_FDIN_OCT_S  5
/* DSPI_MEM_FDOUT_OCT : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Apply 8 signals during write-data phase 1:enable 0: disable.*/
#define DSPI_MEM_FDOUT_OCT    (BIT(4))
#define DSPI_MEM_FDOUT_OCT_M  (BIT(4))
#define DSPI_MEM_FDOUT_OCT_V  0x1
#define DSPI_MEM_FDOUT_OCT_S  4
/* DSPI_MEM_FDUMMY_WOUT : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: In an MSPI write data transfer when accesses to flash, the level of SPI_IO[7:0]
is output by the MSPI controller in the second half part of dummy phase. It is u
sed to pre-drive flash..*/
#define DSPI_MEM_FDUMMY_WOUT    (BIT(3))
#define DSPI_MEM_FDUMMY_WOUT_M  (BIT(3))
#define DSPI_MEM_FDUMMY_WOUT_V  0x1
#define DSPI_MEM_FDUMMY_WOUT_S  3
/* DSPI_MEM_FDUMMY_RIN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: In an MSPI read data transfer when accesses to flash, the level of SPI_IO[7:0] i
s output by the MSPI controller in the first half part of dummy phase. It is use
d to mask invalid SPI_DQS in the half part of dummy phase..*/
#define DSPI_MEM_FDUMMY_RIN    (BIT(2))
#define DSPI_MEM_FDUMMY_RIN_M  (BIT(2))
#define DSPI_MEM_FDUMMY_RIN_V  0x1
#define DSPI_MEM_FDUMMY_RIN_S  2
/* DSPI_MEM_WDUMMY_ALWAYS_OUT : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: In the dummy phase of an MSPI write data transfer when accesses to flash, the le
vel of SPI_IO[7:0] is output by the MSPI controller..*/
#define DSPI_MEM_WDUMMY_ALWAYS_OUT    (BIT(1))
#define DSPI_MEM_WDUMMY_ALWAYS_OUT_M  (BIT(1))
#define DSPI_MEM_WDUMMY_ALWAYS_OUT_V  0x1
#define DSPI_MEM_WDUMMY_ALWAYS_OUT_S  1
/* DSPI_MEM_WDUMMY_DQS_ALWAYS_OUT : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: In the dummy phase of an MSPI write data transfer when accesses to flash, the le
vel of SPI_DQS is output by the MSPI controller..*/
#define DSPI_MEM_WDUMMY_DQS_ALWAYS_OUT    (BIT(0))
#define DSPI_MEM_WDUMMY_DQS_ALWAYS_OUT_M  (BIT(0))
#define DSPI_MEM_WDUMMY_DQS_ALWAYS_OUT_V  0x1
#define DSPI_MEM_WDUMMY_DQS_ALWAYS_OUT_S  0

#define DSPI_MEM_CTRL1_REG          (DR_REG_DSPI_MEM_BASE + 0xC)
/* DSPI_MEM_TXFIFO_RST : WT ;bitpos:[31] ;default: 1'b0 ; */
/*description: The synchronous reset signal for SPI0 TX AFIFO and all the AES_MSPI SYNC FIFO to
 send signals to AXI. Set this bit to reset these FIFO..*/
#define DSPI_MEM_TXFIFO_RST    (BIT(31))
#define DSPI_MEM_TXFIFO_RST_M  (BIT(31))
#define DSPI_MEM_TXFIFO_RST_V  0x1
#define DSPI_MEM_TXFIFO_RST_S  31
/* DSPI_MEM_RXFIFO_RST : WT ;bitpos:[30] ;default: 1'b0 ; */
/*description: The synchronous reset signal for SPI0 RX AFIFO and all the AES_MSPI SYNC FIFO to
 receive signals from AXI.  Set this bit to reset these FIFO..*/
#define DSPI_MEM_RXFIFO_RST    (BIT(30))
#define DSPI_MEM_RXFIFO_RST_M  (BIT(30))
#define DSPI_MEM_RXFIFO_RST_V  0x1
#define DSPI_MEM_RXFIFO_RST_S  30
/* DSPI_MEM_FAST_WRITE_EN : R/W ;bitpos:[29] ;default: 1'b1 ; */
/*description: Set this bit to write data faster, do not wait write data has been stored in tx_
bus_fifo_l2. It will wait 4*T_clk_ctrl to insure the write data has been stored
in  tx_bus_fifo_l2..*/
#define DSPI_MEM_FAST_WRITE_EN    (BIT(29))
#define DSPI_MEM_FAST_WRITE_EN_M  (BIT(29))
#define DSPI_MEM_FAST_WRITE_EN_V  0x1
#define DSPI_MEM_FAST_WRITE_EN_S  29
/* DSPI_MEM_DUAL_RAM_EN : HRO ;bitpos:[28] ;default: 1'b0 ; */
/*description: Set this bit to enable DUAL-RAM mode, EXT_RAM0 and EXT_RAM1 will be accessed at
the same time..*/
#define DSPI_MEM_DUAL_RAM_EN    (BIT(28))
#define DSPI_MEM_DUAL_RAM_EN_M  (BIT(28))
#define DSPI_MEM_DUAL_RAM_EN_V  0x1
#define DSPI_MEM_DUAL_RAM_EN_S  28
/* DSPI_MEM_RAM0_EN : HRO ;bitpos:[27] ;default: 1'b1 ; */
/*description: When SPI_MEM_DUAL_RAM_EN is 0 and SPI_MEM_RAM0_EN is 1, only EXT_RAM0 will be ac
cessed. When SPI_MEM_DUAL_RAM_EN is 0 and SPI_MEM_RAM0_EN is 0, only EXT_RAM1 wi
ll be accessed. When SPI_MEM_DUAL_RAM_EN is 1,  EXT_RAM0 and EXT_RAM1 will be ac
cessed at the same time..*/
#define DSPI_MEM_RAM0_EN    (BIT(27))
#define DSPI_MEM_RAM0_EN_M  (BIT(27))
#define DSPI_MEM_RAM0_EN_V  0x1
#define DSPI_MEM_RAM0_EN_S  27
/* DSPI_MEM_AW_SPLICE_EN : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: Set this bit to enable AXI Write Splice-transfer..*/
#define DSPI_MEM_AW_SPLICE_EN    (BIT(26))
#define DSPI_MEM_AW_SPLICE_EN_M  (BIT(26))
#define DSPI_MEM_AW_SPLICE_EN_V  0x1
#define DSPI_MEM_AW_SPLICE_EN_S  26
/* DSPI_MEM_AR_SPLICE_EN : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: Set this bit to enable AXI Read Splice-transfer..*/
#define DSPI_MEM_AR_SPLICE_EN    (BIT(25))
#define DSPI_MEM_AR_SPLICE_EN_M  (BIT(25))
#define DSPI_MEM_AR_SPLICE_EN_V  0x1
#define DSPI_MEM_AR_SPLICE_EN_S  25
/* DSPI_MEM_RRESP_ECC_ERR_EN : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: 1: RRESP is SLV_ERR when there is a ECC error in AXI read data. 0: RRESP is OKAY
 when there is a ECC error in AXI read data. The ECC error information is record
ed in SPI_MEM_ECC_ERR_ADDR_REG..*/
#define DSPI_MEM_RRESP_ECC_ERR_EN    (BIT(24))
#define DSPI_MEM_RRESP_ECC_ERR_EN_M  (BIT(24))
#define DSPI_MEM_RRESP_ECC_ERR_EN_V  0x1
#define DSPI_MEM_RRESP_ECC_ERR_EN_S  24
/* DSPI_MEM_SPI_AXI_RDATA_BACK_FAST : R/W ;bitpos:[23] ;default: 1'b1 ; */
/*description: 1: Reply AXI read data to AXI bus when one AXI read beat data is available. 0: R
eply AXI read data to AXI bus when all the read data is available..*/
#define DSPI_MEM_SPI_AXI_RDATA_BACK_FAST    (BIT(23))
#define DSPI_MEM_SPI_AXI_RDATA_BACK_FAST_M  (BIT(23))
#define DSPI_MEM_SPI_AXI_RDATA_BACK_FAST_V  0x1
#define DSPI_MEM_SPI_AXI_RDATA_BACK_FAST_S  23
/* DSPI_MEM_SPI_AW_SIZE0_1_SUPPORT_EN : R/W ;bitpos:[22] ;default: 1'b1 ; */
/*description: 1: MSPI supports AWSIZE 0~3. 0: When AWSIZE 0~1, MSPI reply SLV_ERR..*/
#define DSPI_MEM_SPI_AW_SIZE0_1_SUPPORT_EN    (BIT(22))
#define DSPI_MEM_SPI_AW_SIZE0_1_SUPPORT_EN_M  (BIT(22))
#define DSPI_MEM_SPI_AW_SIZE0_1_SUPPORT_EN_V  0x1
#define DSPI_MEM_SPI_AW_SIZE0_1_SUPPORT_EN_S  22
/* DSPI_MEM_SPI_AR_SIZE0_1_SUPPORT_EN : R/W ;bitpos:[21] ;default: 1'b1 ; */
/*description: 1: MSPI supports ARSIZE 0~3. When ARSIZE =0~2, MSPI read address is 4*n and repl
y the real AXI read data back. 0: When ARSIZE 0~1, MSPI reply SLV_ERR..*/
#define DSPI_MEM_SPI_AR_SIZE0_1_SUPPORT_EN    (BIT(21))
#define DSPI_MEM_SPI_AR_SIZE0_1_SUPPORT_EN_M  (BIT(21))
#define DSPI_MEM_SPI_AR_SIZE0_1_SUPPORT_EN_V  0x1
#define DSPI_MEM_SPI_AR_SIZE0_1_SUPPORT_EN_S  21
/* DSPI_MEM_CLK_MODE : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: SPI clock mode bits. 0: SPI clock is off when CS inactive 1: SPI clock is delaye
d one cycle after CS inactive 2: SPI clock is delayed two cycles after CS inacti
ve 3: SPI clock is alwasy on..*/
#define DSPI_MEM_CLK_MODE    0x00000003
#define DSPI_MEM_CLK_MODE_M  ((DSPI_MEM_CLK_MODE_V)<<(DSPI_MEM_CLK_MODE_S))
#define DSPI_MEM_CLK_MODE_V  0x3
#define DSPI_MEM_CLK_MODE_S  0

#define DSPI_MEM_CTRL2_REG          (DR_REG_DSPI_MEM_BASE + 0x10)
/* DSPI_MEM_SYNC_RESET : WT ;bitpos:[31] ;default: 1'b0 ; */
/*description: The spi0_mst_st and spi0_slv_st will be reset..*/
#define DSPI_MEM_SYNC_RESET    (BIT(31))
#define DSPI_MEM_SYNC_RESET_M  (BIT(31))
#define DSPI_MEM_SYNC_RESET_V  0x1
#define DSPI_MEM_SYNC_RESET_S  31
/* DSPI_MEM_CS_HOLD_DELAY : R/W ;bitpos:[30:25] ;default: 6'd0 ; */
/*description: These bits are used to set the minimum CS high time tSHSL between SPI burst tran
sfer when accesses to flash. tSHSL is (SPI_MEM_CS_HOLD_DELAY[5:0] + 1) MSPI core
 clock cycles..*/
#define DSPI_MEM_CS_HOLD_DELAY    0x0000003F
#define DSPI_MEM_CS_HOLD_DELAY_M  ((DSPI_MEM_CS_HOLD_DELAY_V)<<(DSPI_MEM_CS_HOLD_DELAY_S))
#define DSPI_MEM_CS_HOLD_DELAY_V  0x3F
#define DSPI_MEM_CS_HOLD_DELAY_S  25
/* DSPI_MEM_SPLIT_TRANS_EN : R/W ;bitpos:[24] ;default: 1'b1 ; */
/*description: Set this bit to enable SPI0 split one AXI read flash transfer into two SPI trans
fers when one transfer will cross flash or EXT_RAM page corner, valid no matter
whether there is an ECC region or not..*/
#define DSPI_MEM_SPLIT_TRANS_EN    (BIT(24))
#define DSPI_MEM_SPLIT_TRANS_EN_M  (BIT(24))
#define DSPI_MEM_SPLIT_TRANS_EN_V  0x1
#define DSPI_MEM_SPLIT_TRANS_EN_S  24
/* DSPI_MEM_ECC_16TO18_BYTE_EN : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: Set this bit to enable SPI0 and SPI1 ECC 16 bytes data with 2 ECC bytes mode whe
n accesses flash..*/
#define DSPI_MEM_ECC_16TO18_BYTE_EN    (BIT(14))
#define DSPI_MEM_ECC_16TO18_BYTE_EN_M  (BIT(14))
#define DSPI_MEM_ECC_16TO18_BYTE_EN_V  0x1
#define DSPI_MEM_ECC_16TO18_BYTE_EN_S  14
/* DSPI_MEM_ECC_SKIP_PAGE_CORNER : R/W ;bitpos:[13] ;default: 1'b1 ; */
/*description: 1: SPI0 and SPI1 skip page corner when accesses flash. 0: Not skip page corner w
hen accesses flash..*/
#define DSPI_MEM_ECC_SKIP_PAGE_CORNER    (BIT(13))
#define DSPI_MEM_ECC_SKIP_PAGE_CORNER_M  (BIT(13))
#define DSPI_MEM_ECC_SKIP_PAGE_CORNER_V  0x1
#define DSPI_MEM_ECC_SKIP_PAGE_CORNER_S  13
/* DSPI_MEM_ECC_CS_HOLD_TIME : R/W ;bitpos:[12:10] ;default: 3'd3 ; */
/*description: SPI_MEM_CS_HOLD_TIME + SPI_MEM_ECC_CS_HOLD_TIME is the SPI0 CS hold cycle in ECC
 mode when accessed flash..*/
#define DSPI_MEM_ECC_CS_HOLD_TIME    0x00000007
#define DSPI_MEM_ECC_CS_HOLD_TIME_M  ((DSPI_MEM_ECC_CS_HOLD_TIME_V)<<(DSPI_MEM_ECC_CS_HOLD_TIME_S))
#define DSPI_MEM_ECC_CS_HOLD_TIME_V  0x7
#define DSPI_MEM_ECC_CS_HOLD_TIME_S  10
/* DSPI_MEM_CS_HOLD_TIME : R/W ;bitpos:[9:5] ;default: 5'h1 ; */
/*description: SPI CS signal is delayed to inactive by SPI bus clock, this bits are combined wi
th SPI_MEM_CS_HOLD bit..*/
#define DSPI_MEM_CS_HOLD_TIME    0x0000001F
#define DSPI_MEM_CS_HOLD_TIME_M  ((DSPI_MEM_CS_HOLD_TIME_V)<<(DSPI_MEM_CS_HOLD_TIME_S))
#define DSPI_MEM_CS_HOLD_TIME_V  0x1F
#define DSPI_MEM_CS_HOLD_TIME_S  5
/* DSPI_MEM_CS_SETUP_TIME : R/W ;bitpos:[4:0] ;default: 5'h1 ; */
/*description: (cycles-1) of prepare phase by SPI Bus clock, this bits are combined with SPI_ME
M_CS_SETUP bit..*/
#define DSPI_MEM_CS_SETUP_TIME    0x0000001F
#define DSPI_MEM_CS_SETUP_TIME_M  ((DSPI_MEM_CS_SETUP_TIME_V)<<(DSPI_MEM_CS_SETUP_TIME_S))
#define DSPI_MEM_CS_SETUP_TIME_V  0x1F
#define DSPI_MEM_CS_SETUP_TIME_S  0

