espressif/esp-idf/components/soc/esp32p4/include/soc/dspi_mem_reg.h
#define DSPI_MEM_CLOCK_REG          (DR_REG_DSPI_MEM_BASE + 0x14)
/* DSPI_MEM_CLK_EQU_SYSCLK : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: 1: 1-division mode, the frequency of SPI bus clock equals to that of MSPI module
 clock..*/
#define DSPI_MEM_CLK_EQU_SYSCLK    (BIT(31))
#define DSPI_MEM_CLK_EQU_SYSCLK_M  (BIT(31))
#define DSPI_MEM_CLK_EQU_SYSCLK_V  0x1
#define DSPI_MEM_CLK_EQU_SYSCLK_S  31
/* DSPI_MEM_CLKCNT_N : R/W ;bitpos:[23:16] ;default: 8'h3 ; */
/*description: In the master mode it is the divider of spi_mem_clk. So spi_mem_clk frequency is
 system/(spi_mem_clkcnt_N+1).*/
#define DSPI_MEM_CLKCNT_N    0x000000FF
#define DSPI_MEM_CLKCNT_N_M  ((DSPI_MEM_CLKCNT_N_V)<<(DSPI_MEM_CLKCNT_N_S))
#define DSPI_MEM_CLKCNT_N_V  0xFF
#define DSPI_MEM_CLKCNT_N_S  16
/* DSPI_MEM_CLKCNT_H : R/W ;bitpos:[15:8] ;default: 8'h1 ; */
/*description: In the master mode it must be floor((spi_mem_clkcnt_N+1)/2-1)..*/
#define DSPI_MEM_CLKCNT_H    0x000000FF
#define DSPI_MEM_CLKCNT_H_M  ((DSPI_MEM_CLKCNT_H_V)<<(DSPI_MEM_CLKCNT_H_S))
#define DSPI_MEM_CLKCNT_H_V  0xFF
#define DSPI_MEM_CLKCNT_H_S  8
/* DSPI_MEM_CLKCNT_L : R/W ;bitpos:[7:0] ;default: 8'h3 ; */
/*description: In the master mode it must be equal to spi_mem_clkcnt_N..*/
#define DSPI_MEM_CLKCNT_L    0x000000FF
#define DSPI_MEM_CLKCNT_L_M  ((DSPI_MEM_CLKCNT_L_V)<<(DSPI_MEM_CLKCNT_L_S))
#define DSPI_MEM_CLKCNT_L_V  0xFF
#define DSPI_MEM_CLKCNT_L_S  0

#define DSPI_MEM_USER_REG          (DR_REG_DSPI_MEM_BASE + 0x18)
/* DSPI_MEM_USR_DUMMY : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: This bit enable the dummy phase of an operation..*/
#define DSPI_MEM_USR_DUMMY    (BIT(29))
#define DSPI_MEM_USR_DUMMY_M  (BIT(29))
#define DSPI_MEM_USR_DUMMY_V  0x1
#define DSPI_MEM_USR_DUMMY_S  29
/* DSPI_MEM_USR_DUMMY_IDLE : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: spi clock is disable in dummy phase when the bit is enable..*/
#define DSPI_MEM_USR_DUMMY_IDLE    (BIT(26))
#define DSPI_MEM_USR_DUMMY_IDLE_M  (BIT(26))
#define DSPI_MEM_USR_DUMMY_IDLE_V  0x1
#define DSPI_MEM_USR_DUMMY_IDLE_S  26
/* DSPI_MEM_CK_OUT_EDGE : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The bit combined with SPI_MEM_CK_IDLE_EDGE bit to control SPI clock mode 0~3..*/
#define DSPI_MEM_CK_OUT_EDGE    (BIT(9))
#define DSPI_MEM_CK_OUT_EDGE_M  (BIT(9))
#define DSPI_MEM_CK_OUT_EDGE_V  0x1
#define DSPI_MEM_CK_OUT_EDGE_S  9
/* DSPI_MEM_CS_SETUP : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: spi cs is enable when spi is in  prepare  phase. 1: enable 0: disable..*/
#define DSPI_MEM_CS_SETUP    (BIT(7))
#define DSPI_MEM_CS_SETUP_M  (BIT(7))
#define DSPI_MEM_CS_SETUP_V  0x1
#define DSPI_MEM_CS_SETUP_S  7
/* DSPI_MEM_CS_HOLD : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: spi cs keep low when spi is in  done  phase. 1: enable 0: disable..*/
#define DSPI_MEM_CS_HOLD    (BIT(6))
#define DSPI_MEM_CS_HOLD_M  (BIT(6))
#define DSPI_MEM_CS_HOLD_V  0x1
#define DSPI_MEM_CS_HOLD_S  6

#define DSPI_MEM_USER1_REG          (DR_REG_DSPI_MEM_BASE + 0x1C)
/* DSPI_MEM_USR_ADDR_BITLEN : R/W ;bitpos:[31:26] ;default: 6'd23 ; */
/*description: The length in bits of address phase. The register value shall be (bit_num-1)..*/
#define DSPI_MEM_USR_ADDR_BITLEN    0x0000003F
#define DSPI_MEM_USR_ADDR_BITLEN_M  ((DSPI_MEM_USR_ADDR_BITLEN_V)<<(DSPI_MEM_USR_ADDR_BITLEN_S))
#define DSPI_MEM_USR_ADDR_BITLEN_V  0x3F
#define DSPI_MEM_USR_ADDR_BITLEN_S  26
/* DSPI_MEM_USR_DBYTELEN : HRO ;bitpos:[8:6] ;default: 3'd1 ; */
/*description: SPI0 USR_CMD read or write data byte length -1.*/
#define DSPI_MEM_USR_DBYTELEN    0x00000007
#define DSPI_MEM_USR_DBYTELEN_M  ((DSPI_MEM_USR_DBYTELEN_V)<<(DSPI_MEM_USR_DBYTELEN_S))
#define DSPI_MEM_USR_DBYTELEN_V  0x7
#define DSPI_MEM_USR_DBYTELEN_S  6
/* DSPI_MEM_USR_DUMMY_CYCLELEN : R/W ;bitpos:[5:0] ;default: 6'd7 ; */
/*description: The length in spi_mem_clk cycles of dummy phase. The register value shall be (cy
cle_num-1)..*/
#define DSPI_MEM_USR_DUMMY_CYCLELEN    0x0000003F
#define DSPI_MEM_USR_DUMMY_CYCLELEN_M  ((DSPI_MEM_USR_DUMMY_CYCLELEN_V)<<(DSPI_MEM_USR_DUMMY_CYCLELEN_S))
#define DSPI_MEM_USR_DUMMY_CYCLELEN_V  0x3F
#define DSPI_MEM_USR_DUMMY_CYCLELEN_S  0

#define DSPI_MEM_USER2_REG          (DR_REG_DSPI_MEM_BASE + 0x20)
/* DSPI_MEM_USR_COMMAND_BITLEN : R/W ;bitpos:[31:28] ;default: 4'd7 ; */
/*description: The length in bits of command phase. The register value shall be (bit_num-1).*/
#define DSPI_MEM_USR_COMMAND_BITLEN    0x0000000F
#define DSPI_MEM_USR_COMMAND_BITLEN_M  ((DSPI_MEM_USR_COMMAND_BITLEN_V)<<(DSPI_MEM_USR_COMMAND_BITLEN_S))
#define DSPI_MEM_USR_COMMAND_BITLEN_V  0xF
#define DSPI_MEM_USR_COMMAND_BITLEN_S  28
/* DSPI_MEM_USR_COMMAND_VALUE : R/W ;bitpos:[15:0] ;default: 16'b0 ; */
/*description: The value of  command..*/
#define DSPI_MEM_USR_COMMAND_VALUE    0x0000FFFF
#define DSPI_MEM_USR_COMMAND_VALUE_M  ((DSPI_MEM_USR_COMMAND_VALUE_V)<<(DSPI_MEM_USR_COMMAND_VALUE_S))
#define DSPI_MEM_USR_COMMAND_VALUE_V  0xFFFF
#define DSPI_MEM_USR_COMMAND_VALUE_S  0

#define DSPI_MEM_RD_STATUS_REG          (DR_REG_DSPI_MEM_BASE + 0x2C)
/* DSPI_MEM_WB_MODE : R/W ;bitpos:[23:16] ;default: 8'h00 ; */
/*description: Mode bits in the flash fast read mode  it is combined with spi_mem_fastrd_mode b
it..*/
#define DSPI_MEM_WB_MODE    0x000000FF
#define DSPI_MEM_WB_MODE_M  ((DSPI_MEM_WB_MODE_V)<<(DSPI_MEM_WB_MODE_S))
#define DSPI_MEM_WB_MODE_V  0xFF
#define DSPI_MEM_WB_MODE_S  16

#define DSPI_MEM_MISC_REG          (DR_REG_DSPI_MEM_BASE + 0x34)
/* DSPI_MEM_CS_KEEP_ACTIVE : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: SPI_CS line keep low when the bit is set..*/
#define DSPI_MEM_CS_KEEP_ACTIVE    (BIT(10))
#define DSPI_MEM_CS_KEEP_ACTIVE_M  (BIT(10))
#define DSPI_MEM_CS_KEEP_ACTIVE_V  0x1
#define DSPI_MEM_CS_KEEP_ACTIVE_S  10
/* DSPI_MEM_CK_IDLE_EDGE : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: 1: SPI_CLK line is high when idle     0: spi clk line is low when idle.*/
#define DSPI_MEM_CK_IDLE_EDGE    (BIT(9))
#define DSPI_MEM_CK_IDLE_EDGE_M  (BIT(9))
#define DSPI_MEM_CK_IDLE_EDGE_V  0x1
#define DSPI_MEM_CK_IDLE_EDGE_S  9
/* DSPI_MEM_SSUB_PIN : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: For SPI0,  sram is connected to SUBPINs..*/
#define DSPI_MEM_SSUB_PIN    (BIT(8))
#define DSPI_MEM_SSUB_PIN_M  (BIT(8))
#define DSPI_MEM_SSUB_PIN_V  0x1
#define DSPI_MEM_SSUB_PIN_S  8
/* DSPI_MEM_FSUB_PIN : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: For SPI0,  flash is connected to SUBPINs..*/
#define DSPI_MEM_FSUB_PIN    (BIT(7))
#define DSPI_MEM_FSUB_PIN_M  (BIT(7))
#define DSPI_MEM_FSUB_PIN_V  0x1
#define DSPI_MEM_FSUB_PIN_S  7

#define DSPI_MEM_CACHE_FCTRL_REG          (DR_REG_DSPI_MEM_BASE + 0x3C)
/* DSPI_MEM_SPI_CLOSE_AXI_INF_EN : R/W ;bitpos:[31] ;default: 1'b1 ; */
/*description: Set this bit to close AXI read/write transfer to MSPI, which means that only SLV
_ERR will be replied to BRESP/RRESP..*/
#define DSPI_MEM_SPI_CLOSE_AXI_INF_EN    (BIT(31))
#define DSPI_MEM_SPI_CLOSE_AXI_INF_EN_M  (BIT(31))
#define DSPI_MEM_SPI_CLOSE_AXI_INF_EN_V  0x1
#define DSPI_MEM_SPI_CLOSE_AXI_INF_EN_S  31
/* DSPI_MEM_SPI_SAME_AW_AR_ADDR_CHK_EN : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: Set this bit to check AXI read/write the same address region..*/
#define DSPI_MEM_SPI_SAME_AW_AR_ADDR_CHK_EN    (BIT(30))
#define DSPI_MEM_SPI_SAME_AW_AR_ADDR_CHK_EN_M  (BIT(30))
#define DSPI_MEM_SPI_SAME_AW_AR_ADDR_CHK_EN_V  0x1
#define DSPI_MEM_SPI_SAME_AW_AR_ADDR_CHK_EN_S  30
/* DSPI_MEM_FADDR_QUAD : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: For SPI0 flash, address phase apply 4 signals. 1: enable 0: disable.  The bit is
 the same with spi_mem_fread_qio..*/
#define DSPI_MEM_FADDR_QUAD    (BIT(8))
#define DSPI_MEM_FADDR_QUAD_M  (BIT(8))
#define DSPI_MEM_FADDR_QUAD_V  0x1
#define DSPI_MEM_FADDR_QUAD_S  8
/* DSPI_MEM_FDOUT_QUAD : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: For SPI0 flash, dout phase apply 4 signals. 1: enable 0: disable.  The bit is th
e same with spi_mem_fread_qio..*/
#define DSPI_MEM_FDOUT_QUAD    (BIT(7))
#define DSPI_MEM_FDOUT_QUAD_M  (BIT(7))
#define DSPI_MEM_FDOUT_QUAD_V  0x1
#define DSPI_MEM_FDOUT_QUAD_S  7
/* DSPI_MEM_FDIN_QUAD : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: For SPI0 flash, din phase apply 4 signals. 1: enable 0: disable.  The bit is the
 same with spi_mem_fread_qio..*/
#define DSPI_MEM_FDIN_QUAD    (BIT(6))
#define DSPI_MEM_FDIN_QUAD_M  (BIT(6))
#define DSPI_MEM_FDIN_QUAD_V  0x1
#define DSPI_MEM_FDIN_QUAD_S  6
/* DSPI_MEM_FADDR_DUAL : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: For SPI0 flash, address phase apply 2 signals. 1: enable 0: disable.  The bit is
 the same with spi_mem_fread_dio..*/
#define DSPI_MEM_FADDR_DUAL    (BIT(5))
#define DSPI_MEM_FADDR_DUAL_M  (BIT(5))
#define DSPI_MEM_FADDR_DUAL_V  0x1
#define DSPI_MEM_FADDR_DUAL_S  5
/* DSPI_MEM_FDOUT_DUAL : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: For SPI0 flash, dout phase apply 2 signals. 1: enable 0: disable. The bit is the
 same with spi_mem_fread_dio..*/
#define DSPI_MEM_FDOUT_DUAL    (BIT(4))
#define DSPI_MEM_FDOUT_DUAL_M  (BIT(4))
#define DSPI_MEM_FDOUT_DUAL_V  0x1
#define DSPI_MEM_FDOUT_DUAL_S  4
/* DSPI_MEM_FDIN_DUAL : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: For SPI0 flash, din phase apply 2 signals. 1: enable 0: disable. The bit is the
same with spi_mem_fread_dio..*/
#define DSPI_MEM_FDIN_DUAL    (BIT(3))
#define DSPI_MEM_FDIN_DUAL_M  (BIT(3))
#define DSPI_MEM_FDIN_DUAL_V  0x1
#define DSPI_MEM_FDIN_DUAL_S  3
/* DSPI_MEM_CACHE_FLASH_USR_CMD : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: For SPI0,  cache  read flash for user define command, 1: enable, 0:disable..*/
#define DSPI_MEM_CACHE_FLASH_USR_CMD    (BIT(2))
#define DSPI_MEM_CACHE_FLASH_USR_CMD_M  (BIT(2))
#define DSPI_MEM_CACHE_FLASH_USR_CMD_V  0x1
#define DSPI_MEM_CACHE_FLASH_USR_CMD_S  2
/* DSPI_MEM_CACHE_USR_ADDR_4BYTE : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: For SPI0,  cache  read flash with 4 bytes address, 1: enable, 0:disable..*/
#define DSPI_MEM_CACHE_USR_ADDR_4BYTE    (BIT(1))
#define DSPI_MEM_CACHE_USR_ADDR_4BYTE_M  (BIT(1))
#define DSPI_MEM_CACHE_USR_ADDR_4BYTE_V  0x1
#define DSPI_MEM_CACHE_USR_ADDR_4BYTE_S  1
/* DSPI_MEM_AXI_REQ_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: For SPI0, AXI master access enable, 1: enable, 0:disable..*/
#define DSPI_MEM_AXI_REQ_EN    (BIT(0))
#define DSPI_MEM_AXI_REQ_EN_M  (BIT(0))
#define DSPI_MEM_AXI_REQ_EN_V  0x1
#define DSPI_MEM_AXI_REQ_EN_S  0

#define DSPI_MEM_CACHE_SCTRL_REG          (DR_REG_DSPI_MEM_BASE + 0x40)
/* DSPI_MEM_SRAM_WDUMMY_CYCLELEN : R/W ;bitpos:[27:22] ;default: 6'b1 ; */
/*description: For SPI0, In the external RAM mode, it is the length in bits of write dummy phas
e. The register value shall be (bit_num-1)..*/
#define DSPI_MEM_SRAM_WDUMMY_CYCLELEN    0x0000003F
#define DSPI_MEM_SRAM_WDUMMY_CYCLELEN_M  ((DSPI_MEM_SRAM_WDUMMY_CYCLELEN_V)<<(DSPI_MEM_SRAM_WDUMMY_CYCLELEN_S))
#define DSPI_MEM_SRAM_WDUMMY_CYCLELEN_V  0x3F
#define DSPI_MEM_SRAM_WDUMMY_CYCLELEN_S  22
/* DSPI_MEM_SRAM_OCT : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: reserved.*/
#define DSPI_MEM_SRAM_OCT    (BIT(21))
#define DSPI_MEM_SRAM_OCT_M  (BIT(21))
#define DSPI_MEM_SRAM_OCT_V  0x1
#define DSPI_MEM_SRAM_OCT_S  21
/* DSPI_MEM_CACHE_SRAM_USR_WCMD : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: For SPI0, In the external RAM mode cache write sram for user define command.*/
#define DSPI_MEM_CACHE_SRAM_USR_WCMD    (BIT(20))
#define DSPI_MEM_CACHE_SRAM_USR_WCMD_M  (BIT(20))
#define DSPI_MEM_CACHE_SRAM_USR_WCMD_V  0x1
#define DSPI_MEM_CACHE_SRAM_USR_WCMD_S  20
/* DSPI_MEM_SRAM_ADDR_BITLEN : R/W ;bitpos:[19:14] ;default: 6'd23 ; */
/*description: For SPI0, In the external RAM mode, it is the length in bits of address phase. T
he register value shall be (bit_num-1)..*/
#define DSPI_MEM_SRAM_ADDR_BITLEN    0x0000003F
#define DSPI_MEM_SRAM_ADDR_BITLEN_M  ((DSPI_MEM_SRAM_ADDR_BITLEN_V)<<(DSPI_MEM_SRAM_ADDR_BITLEN_S))
#define DSPI_MEM_SRAM_ADDR_BITLEN_V  0x3F
#define DSPI_MEM_SRAM_ADDR_BITLEN_S  14
/* DSPI_MEM_SRAM_RDUMMY_CYCLELEN : R/W ;bitpos:[11:6] ;default: 6'b1 ; */
/*description: For SPI0, In the external RAM mode, it is the length in bits of read dummy phase
. The register value shall be (bit_num-1)..*/
#define DSPI_MEM_SRAM_RDUMMY_CYCLELEN    0x0000003F
#define DSPI_MEM_SRAM_RDUMMY_CYCLELEN_M  ((DSPI_MEM_SRAM_RDUMMY_CYCLELEN_V)<<(DSPI_MEM_SRAM_RDUMMY_CYCLELEN_S))
#define DSPI_MEM_SRAM_RDUMMY_CYCLELEN_V  0x3F
#define DSPI_MEM_SRAM_RDUMMY_CYCLELEN_S  6
/* DSPI_MEM_CACHE_SRAM_USR_RCMD : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: For SPI0, In the external RAM mode cache read external RAM for user define comma
nd..*/
#define DSPI_MEM_CACHE_SRAM_USR_RCMD    (BIT(5))
#define DSPI_MEM_CACHE_SRAM_USR_RCMD_M  (BIT(5))
#define DSPI_MEM_CACHE_SRAM_USR_RCMD_V  0x1
#define DSPI_MEM_CACHE_SRAM_USR_RCMD_S  5
/* DSPI_MEM_USR_RD_SRAM_DUMMY : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: For SPI0, In the external RAM mode, it is the enable bit of dummy phase for read
 operations..*/
#define DSPI_MEM_USR_RD_SRAM_DUMMY    (BIT(4))
#define DSPI_MEM_USR_RD_SRAM_DUMMY_M  (BIT(4))
#define DSPI_MEM_USR_RD_SRAM_DUMMY_V  0x1
#define DSPI_MEM_USR_RD_SRAM_DUMMY_S  4
/* DSPI_MEM_USR_WR_SRAM_DUMMY : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: For SPI0, In the external RAM mode, it is the enable bit of dummy phase for writ
e operations..*/
#define DSPI_MEM_USR_WR_SRAM_DUMMY    (BIT(3))
#define DSPI_MEM_USR_WR_SRAM_DUMMY_M  (BIT(3))
#define DSPI_MEM_USR_WR_SRAM_DUMMY_V  0x1
#define DSPI_MEM_USR_WR_SRAM_DUMMY_S  3
/* DSPI_MEM_USR_SRAM_QIO : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: For SPI0, In the external RAM mode, spi quad I/O mode enable, 1: enable, 0:disab
le.*/
#define DSPI_MEM_USR_SRAM_QIO    (BIT(2))
#define DSPI_MEM_USR_SRAM_QIO_M  (BIT(2))
#define DSPI_MEM_USR_SRAM_QIO_V  0x1
#define DSPI_MEM_USR_SRAM_QIO_S  2
/* DSPI_MEM_USR_SRAM_DIO : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: For SPI0, In the external RAM mode, spi dual I/O mode enable, 1: enable, 0:disab
le.*/
#define DSPI_MEM_USR_SRAM_DIO    (BIT(1))
#define DSPI_MEM_USR_SRAM_DIO_M  (BIT(1))
#define DSPI_MEM_USR_SRAM_DIO_V  0x1
#define DSPI_MEM_USR_SRAM_DIO_S  1
/* DSPI_MEM_CACHE_USR_SADDR_4BYTE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: For SPI0, In the external RAM mode, cache read flash with 4 bytes command, 1: en
able, 0:disable..*/
#define DSPI_MEM_CACHE_USR_SADDR_4BYTE    (BIT(0))
#define DSPI_MEM_CACHE_USR_SADDR_4BYTE_M  (BIT(0))
#define DSPI_MEM_CACHE_USR_SADDR_4BYTE_V  0x1
#define DSPI_MEM_CACHE_USR_SADDR_4BYTE_S  0

#define DSPI_MEM_SRAM_CMD_REG          (DR_REG_DSPI_MEM_BASE + 0x44)
/* DSPI_SMEM_DATA_IE_ALWAYS_ON : R/W ;bitpos:[31] ;default: 1'b1 ; */
/*description: When accesses to external RAM, 1: the IE signals of pads connected to SPI_IO[7:0
] are always 1. 0: Others..*/
#define DSPI_SMEM_DATA_IE_ALWAYS_ON    (BIT(31))
#define DSPI_SMEM_DATA_IE_ALWAYS_ON_M  (BIT(31))
#define DSPI_SMEM_DATA_IE_ALWAYS_ON_V  0x1
#define DSPI_SMEM_DATA_IE_ALWAYS_ON_S  31
/* DSPI_SMEM_DQS_IE_ALWAYS_ON : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: When accesses to external RAM, 1: the IE signals of pads connected to SPI_DQS ar
e always 1. 0: Others..*/
#define DSPI_SMEM_DQS_IE_ALWAYS_ON    (BIT(30))
#define DSPI_SMEM_DQS_IE_ALWAYS_ON_M  (BIT(30))
#define DSPI_SMEM_DQS_IE_ALWAYS_ON_V  0x1
#define DSPI_SMEM_DQS_IE_ALWAYS_ON_S  30
/* DSPI_MEM_SDOUT_HEX : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , dout phase apply 16 signals. 1: enable 0: disable..*/
#define DSPI_MEM_SDOUT_HEX    (BIT(27))
#define DSPI_MEM_SDOUT_HEX_M  (BIT(27))
#define DSPI_MEM_SDOUT_HEX_V  0x1
#define DSPI_MEM_SDOUT_HEX_S  27
/* DSPI_MEM_SDIN_HEX : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , din phase apply 16 signals. 1: enable 0: disable..*/
#define DSPI_MEM_SDIN_HEX    (BIT(26))
#define DSPI_MEM_SDIN_HEX_M  (BIT(26))
#define DSPI_MEM_SDIN_HEX_V  0x1
#define DSPI_MEM_SDIN_HEX_S  26
/* DSPI_SMEM_WDUMMY_ALWAYS_OUT : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: In the dummy phase of an MSPI write data transfer when accesses to external RAM,
 the level of SPI_IO[7:0] is output by the MSPI controller..*/
#define DSPI_SMEM_WDUMMY_ALWAYS_OUT    (BIT(25))
#define DSPI_SMEM_WDUMMY_ALWAYS_OUT_M  (BIT(25))
#define DSPI_SMEM_WDUMMY_ALWAYS_OUT_V  0x1
#define DSPI_SMEM_WDUMMY_ALWAYS_OUT_S  25
/* DSPI_SMEM_WDUMMY_DQS_ALWAYS_OUT : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: In the dummy phase of an MSPI write data transfer when accesses to external RAM,
 the level of SPI_DQS is output by the MSPI controller..*/
#define DSPI_SMEM_WDUMMY_DQS_ALWAYS_OUT    (BIT(24))
#define DSPI_SMEM_WDUMMY_DQS_ALWAYS_OUT_M  (BIT(24))
#define DSPI_SMEM_WDUMMY_DQS_ALWAYS_OUT_V  0x1
#define DSPI_SMEM_WDUMMY_DQS_ALWAYS_OUT_S  24
/* DSPI_MEM_SDUMMY_WOUT : R/W ;bitpos:[23] ;default: 1'b1 ; */
/*description: In the dummy phase of a MSPI write data transfer when accesses to external RAM,
the signal level of SPI bus is output by the MSPI controller..*/
#define DSPI_MEM_SDUMMY_WOUT    (BIT(23))
#define DSPI_MEM_SDUMMY_WOUT_M  (BIT(23))
#define DSPI_MEM_SDUMMY_WOUT_V  0x1
#define DSPI_MEM_SDUMMY_WOUT_S  23
/* DSPI_MEM_SDUMMY_RIN : R/W ;bitpos:[22] ;default: 1'b1 ; */
/*description: In the dummy phase of a MSPI read data transfer when accesses to external RAM, t
he signal level of SPI bus is output by the MSPI controller..*/
#define DSPI_MEM_SDUMMY_RIN    (BIT(22))
#define DSPI_MEM_SDUMMY_RIN_M  (BIT(22))
#define DSPI_MEM_SDUMMY_RIN_V  0x1
#define DSPI_MEM_SDUMMY_RIN_S  22
/* DSPI_MEM_SCMD_OCT : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , cmd phase apply 8 signals. 1: enable 0: disable..*/
#define DSPI_MEM_SCMD_OCT    (BIT(21))
#define DSPI_MEM_SCMD_OCT_M  (BIT(21))
#define DSPI_MEM_SCMD_OCT_V  0x1
#define DSPI_MEM_SCMD_OCT_S  21
/* DSPI_MEM_SADDR_OCT : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , address phase apply 4 signals. 1: enable 0: disable..*/
#define DSPI_MEM_SADDR_OCT    (BIT(20))
#define DSPI_MEM_SADDR_OCT_M  (BIT(20))
#define DSPI_MEM_SADDR_OCT_V  0x1
#define DSPI_MEM_SADDR_OCT_S  20
/* DSPI_MEM_SDOUT_OCT : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , dout phase apply 8 signals. 1: enable 0: disable..*/
#define DSPI_MEM_SDOUT_OCT    (BIT(19))
#define DSPI_MEM_SDOUT_OCT_M  (BIT(19))
#define DSPI_MEM_SDOUT_OCT_V  0x1
#define DSPI_MEM_SDOUT_OCT_S  19
/* DSPI_MEM_SDIN_OCT : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , din phase apply 8 signals. 1: enable 0: disable..*/
#define DSPI_MEM_SDIN_OCT    (BIT(18))
#define DSPI_MEM_SDIN_OCT_M  (BIT(18))
#define DSPI_MEM_SDIN_OCT_V  0x1
#define DSPI_MEM_SDIN_OCT_S  18
/* DSPI_MEM_SCMD_QUAD : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , cmd phase apply 4 signals. 1: enable 0: disable. The bit
 is the same with spi_mem_usr_sram_qio..*/
#define DSPI_MEM_SCMD_QUAD    (BIT(17))
#define DSPI_MEM_SCMD_QUAD_M  (BIT(17))
#define DSPI_MEM_SCMD_QUAD_V  0x1
#define DSPI_MEM_SCMD_QUAD_S  17
/* DSPI_MEM_SADDR_QUAD : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , address phase apply 4 signals. 1: enable 0: disable. The
 bit is the same with spi_mem_usr_sram_qio..*/
#define DSPI_MEM_SADDR_QUAD    (BIT(16))
#define DSPI_MEM_SADDR_QUAD_M  (BIT(16))
#define DSPI_MEM_SADDR_QUAD_V  0x1
#define DSPI_MEM_SADDR_QUAD_S  16
/* DSPI_MEM_SDOUT_QUAD : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , dout phase apply 4 signals. 1: enable 0: disable. The bi
t is the same with spi_mem_usr_sram_qio..*/
#define DSPI_MEM_SDOUT_QUAD    (BIT(15))
#define DSPI_MEM_SDOUT_QUAD_M  (BIT(15))
#define DSPI_MEM_SDOUT_QUAD_V  0x1
#define DSPI_MEM_SDOUT_QUAD_S  15
/* DSPI_MEM_SDIN_QUAD : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , din phase apply 4 signals. 1: enable 0: disable. The bit
 is the same with spi_mem_usr_sram_qio..*/
#define DSPI_MEM_SDIN_QUAD    (BIT(14))
#define DSPI_MEM_SDIN_QUAD_M  (BIT(14))
#define DSPI_MEM_SDIN_QUAD_V  0x1
#define DSPI_MEM_SDIN_QUAD_S  14
/* DSPI_MEM_SADDR_DUAL : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , address phase apply 2 signals. 1: enable 0: disable. The
 bit is the same with spi_mem_usr_sram_dio..*/
#define DSPI_MEM_SADDR_DUAL    (BIT(12))
#define DSPI_MEM_SADDR_DUAL_M  (BIT(12))
#define DSPI_MEM_SADDR_DUAL_V  0x1
#define DSPI_MEM_SADDR_DUAL_S  12
/* DSPI_MEM_SDOUT_DUAL : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , dout phase apply 2 signals. 1: enable 0: disable. The bi
t is the same with spi_mem_usr_sram_dio..*/
#define DSPI_MEM_SDOUT_DUAL    (BIT(11))
#define DSPI_MEM_SDOUT_DUAL_M  (BIT(11))
#define DSPI_MEM_SDOUT_DUAL_V  0x1
#define DSPI_MEM_SDOUT_DUAL_S  11
/* DSPI_MEM_SDIN_DUAL : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: For SPI0 external RAM , din phase apply 2 signals. 1: enable 0: disable. The bit
 is the same with spi_mem_usr_sram_dio..*/
#define DSPI_MEM_SDIN_DUAL    (BIT(10))
#define DSPI_MEM_SDIN_DUAL_M  (BIT(10))
#define DSPI_MEM_SDIN_DUAL_V  0x1
#define DSPI_MEM_SDIN_DUAL_S  10
/* DSPI_MEM_SWB_MODE : R/W ;bitpos:[9:2] ;default: 8'b0 ; */
/*description: Mode bits in the external RAM fast read mode  it is combined with spi_mem_fastrd
_mode bit..*/
#define DSPI_MEM_SWB_MODE    0x000000FF
#define DSPI_MEM_SWB_MODE_M  ((DSPI_MEM_SWB_MODE_V)<<(DSPI_MEM_SWB_MODE_S))
#define DSPI_MEM_SWB_MODE_V  0xFF
#define DSPI_MEM_SWB_MODE_S  2
/* DSPI_MEM_SCLK_MODE : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: SPI clock mode bits. 0: SPI clock is off when CS inactive 1: SPI clock is delaye
d one cycle after CS inactive 2: SPI clock is delayed two cycles after CS inacti
ve 3: SPI clock is always on..*/
#define DSPI_MEM_SCLK_MODE    0x00000003
#define DSPI_MEM_SCLK_MODE_M  ((DSPI_MEM_SCLK_MODE_V)<<(DSPI_MEM_SCLK_MODE_S))
#define DSPI_MEM_SCLK_MODE_V  0x3
#define DSPI_MEM_SCLK_MODE_S  0

#define DSPI_MEM_SRAM_DRD_CMD_REG          (DR_REG_DSPI_MEM_BASE + 0x48)
/* DSPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN : R/W ;bitpos:[31:28] ;default: 4'h0 ; */
/*description: For SPI0,When cache mode is enable it is the length in bits of command phase for
 sram. The register value shall be (bit_num-1)..*/
#define DSPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN    0x0000000F
#define DSPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_M  ((DSPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_V)<<(DSPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_S))
#define DSPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_V  0xF
#define DSPI_MEM_CACHE_SRAM_USR_RD_CMD_BITLEN_S  28
/* DSPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: For SPI0,When cache mode is enable it is the read command value of command phase
 for sram..*/
#define DSPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE    0x0000FFFF
#define DSPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_M  ((DSPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_V)<<(DSPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_S))
#define DSPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_V  0xFFFF
#define DSPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE_S  0

