espressif/esp-idf/components/soc/esp32p4/include/soc/dspi_mem_reg.h
#define DSPI_MEM_SRAM_DWR_CMD_REG          (DR_REG_DSPI_MEM_BASE + 0x4C)
/* DSPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN : R/W ;bitpos:[31:28] ;default: 4'h0 ; */
/*description: For SPI0,When cache mode is enable it is the in bits of command phase  for sram.
 The register value shall be (bit_num-1)..*/
#define DSPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN    0x0000000F
#define DSPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_M  ((DSPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_V)<<(DSPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_S))
#define DSPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_V  0xF
#define DSPI_MEM_CACHE_SRAM_USR_WR_CMD_BITLEN_S  28
/* DSPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: For SPI0,When cache mode is enable it is the write command value of command phas
e for sram..*/
#define DSPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE    0x0000FFFF
#define DSPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_M  ((DSPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_V)<<(DSPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_S))
#define DSPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_V  0xFFFF
#define DSPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE_S  0

#define DSPI_MEM_SRAM_CLK_REG          (DR_REG_DSPI_MEM_BASE + 0x50)
/* DSPI_MEM_SCLK_EQU_SYSCLK : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: For SPI0 external RAM  interface, 1: spi_mem_clk is eqaul to system 0: spi_mem_c
lk is divided from system clock..*/
#define DSPI_MEM_SCLK_EQU_SYSCLK    (BIT(31))
#define DSPI_MEM_SCLK_EQU_SYSCLK_M  (BIT(31))
#define DSPI_MEM_SCLK_EQU_SYSCLK_V  0x1
#define DSPI_MEM_SCLK_EQU_SYSCLK_S  31
/* DSPI_MEM_SCLKCNT_N : R/W ;bitpos:[23:16] ;default: 8'h3 ; */
/*description: For SPI0 external RAM  interface, it is the divider of spi_mem_clk. So spi_mem_c
lk frequency is system/(spi_mem_clkcnt_N+1).*/
#define DSPI_MEM_SCLKCNT_N    0x000000FF
#define DSPI_MEM_SCLKCNT_N_M  ((DSPI_MEM_SCLKCNT_N_V)<<(DSPI_MEM_SCLKCNT_N_S))
#define DSPI_MEM_SCLKCNT_N_V  0xFF
#define DSPI_MEM_SCLKCNT_N_S  16
/* DSPI_MEM_SCLKCNT_H : R/W ;bitpos:[15:8] ;default: 8'h1 ; */
/*description: For SPI0 external RAM  interface, it must be floor((spi_mem_clkcnt_N+1)/2-1)..*/
#define DSPI_MEM_SCLKCNT_H    0x000000FF
#define DSPI_MEM_SCLKCNT_H_M  ((DSPI_MEM_SCLKCNT_H_V)<<(DSPI_MEM_SCLKCNT_H_S))
#define DSPI_MEM_SCLKCNT_H_V  0xFF
#define DSPI_MEM_SCLKCNT_H_S  8
/* DSPI_MEM_SCLKCNT_L : R/W ;bitpos:[7:0] ;default: 8'h3 ; */
/*description: For SPI0 external RAM  interface, it must be equal to spi_mem_clkcnt_N..*/
#define DSPI_MEM_SCLKCNT_L    0x000000FF
#define DSPI_MEM_SCLKCNT_L_M  ((DSPI_MEM_SCLKCNT_L_V)<<(DSPI_MEM_SCLKCNT_L_S))
#define DSPI_MEM_SCLKCNT_L_V  0xFF
#define DSPI_MEM_SCLKCNT_L_S  0

#define DSPI_MEM_FSM_REG          (DR_REG_DSPI_MEM_BASE + 0x54)
/* DSPI_MEM_LOCK_DELAY_TIME : R/W ;bitpos:[11:7] ;default: 5'd4 ; */
/*description: The lock delay time of SPI0/1 arbiter by spi0_slv_st, after PER is sent by SPI1..*/
#define DSPI_MEM_LOCK_DELAY_TIME    0x0000001F
#define DSPI_MEM_LOCK_DELAY_TIME_M  ((DSPI_MEM_LOCK_DELAY_TIME_V)<<(DSPI_MEM_LOCK_DELAY_TIME_S))
#define DSPI_MEM_LOCK_DELAY_TIME_V  0x1F
#define DSPI_MEM_LOCK_DELAY_TIME_S  7

#define DSPI_MEM_INT_ENA_REG          (DR_REG_DSPI_MEM_BASE + 0xC0)
/* DSPI_MEM_BUS_FIFO0_UDF_INT_ENA : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_BUS_FIFO0_UDF_INT interrupt..*/
#define DSPI_MEM_BUS_FIFO0_UDF_INT_ENA    (BIT(31))
#define DSPI_MEM_BUS_FIFO0_UDF_INT_ENA_M  (BIT(31))
#define DSPI_MEM_BUS_FIFO0_UDF_INT_ENA_V  0x1
#define DSPI_MEM_BUS_FIFO0_UDF_INT_ENA_S  31
/* DSPI_MEM_BUS_FIFO1_UDF_INT_ENA : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_BUS_FIFO1_UDF_INT interrupt..*/
#define DSPI_MEM_BUS_FIFO1_UDF_INT_ENA    (BIT(30))
#define DSPI_MEM_BUS_FIFO1_UDF_INT_ENA_M  (BIT(30))
#define DSPI_MEM_BUS_FIFO1_UDF_INT_ENA_V  0x1
#define DSPI_MEM_BUS_FIFO1_UDF_INT_ENA_S  30
/* DSPI_MEM_DQS1_AFIFO_OVF_INT_ENA : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_DQS1_AFIFO_OVF_INT interrupt..*/
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_ENA    (BIT(29))
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_ENA_M  (BIT(29))
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_ENA_V  0x1
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_ENA_S  29
/* DSPI_MEM_DQS0_AFIFO_OVF_INT_ENA : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_DQS0_AFIFO_OVF_INT interrupt..*/
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_ENA    (BIT(28))
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_ENA_M  (BIT(28))
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_ENA_V  0x1
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_ENA_S  28
/* DSPI_MEM_AXI_WADDR_ERR_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_AXI_WADDR_ERR_INT interrupt..*/
#define DSPI_MEM_AXI_WADDR_ERR_INT_ENA    (BIT(9))
#define DSPI_MEM_AXI_WADDR_ERR_INT_ENA_M  (BIT(9))
#define DSPI_MEM_AXI_WADDR_ERR_INT_ENA_V  0x1
#define DSPI_MEM_AXI_WADDR_ERR_INT_ENA_S  9
/* DSPI_MEM_AXI_WR_FLASH_ERR_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_AXI_WR_FALSH_ERR_INT interrupt..*/
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_ENA    (BIT(8))
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_ENA_M  (BIT(8))
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_ENA_V  0x1
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_ENA_S  8
/* DSPI_MEM_AXI_RADDR_ERR_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_AXI_RADDR_ERR_INT interrupt..*/
#define DSPI_MEM_AXI_RADDR_ERR_INT_ENA    (BIT(7))
#define DSPI_MEM_AXI_RADDR_ERR_INT_ENA_M  (BIT(7))
#define DSPI_MEM_AXI_RADDR_ERR_INT_ENA_V  0x1
#define DSPI_MEM_AXI_RADDR_ERR_INT_ENA_S  7
/* DSPI_MEM_PMS_REJECT_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_PMS_REJECT_INT interrupt..*/
#define DSPI_MEM_PMS_REJECT_INT_ENA    (BIT(6))
#define DSPI_MEM_PMS_REJECT_INT_ENA_M  (BIT(6))
#define DSPI_MEM_PMS_REJECT_INT_ENA_V  0x1
#define DSPI_MEM_PMS_REJECT_INT_ENA_S  6
/* DSPI_MEM_ECC_ERR_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_ECC_ERR_INT interrupt..*/
#define DSPI_MEM_ECC_ERR_INT_ENA    (BIT(5))
#define DSPI_MEM_ECC_ERR_INT_ENA_M  (BIT(5))
#define DSPI_MEM_ECC_ERR_INT_ENA_V  0x1
#define DSPI_MEM_ECC_ERR_INT_ENA_S  5
/* DSPI_MEM_MST_ST_END_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_MST_ST_END_INT interrupt..*/
#define DSPI_MEM_MST_ST_END_INT_ENA    (BIT(4))
#define DSPI_MEM_MST_ST_END_INT_ENA_M  (BIT(4))
#define DSPI_MEM_MST_ST_END_INT_ENA_V  0x1
#define DSPI_MEM_MST_ST_END_INT_ENA_S  4
/* DSPI_MEM_SLV_ST_END_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_SLV_ST_END_INT interrupt..*/
#define DSPI_MEM_SLV_ST_END_INT_ENA    (BIT(3))
#define DSPI_MEM_SLV_ST_END_INT_ENA_M  (BIT(3))
#define DSPI_MEM_SLV_ST_END_INT_ENA_V  0x1
#define DSPI_MEM_SLV_ST_END_INT_ENA_S  3

#define DSPI_MEM_INT_CLR_REG          (DR_REG_DSPI_MEM_BASE + 0xC4)
/* DSPI_MEM_BUS_FIFO0_UDF_INT_CLR : WT ;bitpos:[31] ;default: 1'b0 ; */
/*description: The clear bit for SPI_MEM_BUS_FIFO0_UDF_INT interrupt..*/
#define DSPI_MEM_BUS_FIFO0_UDF_INT_CLR    (BIT(31))
#define DSPI_MEM_BUS_FIFO0_UDF_INT_CLR_M  (BIT(31))
#define DSPI_MEM_BUS_FIFO0_UDF_INT_CLR_V  0x1
#define DSPI_MEM_BUS_FIFO0_UDF_INT_CLR_S  31
/* DSPI_MEM_BUS_FIFO1_UDF_INT_CLR : WT ;bitpos:[30] ;default: 1'b0 ; */
/*description: The clear bit for SPI_MEM_BUS_FIFO1_UDF_INT interrupt..*/
#define DSPI_MEM_BUS_FIFO1_UDF_INT_CLR    (BIT(30))
#define DSPI_MEM_BUS_FIFO1_UDF_INT_CLR_M  (BIT(30))
#define DSPI_MEM_BUS_FIFO1_UDF_INT_CLR_V  0x1
#define DSPI_MEM_BUS_FIFO1_UDF_INT_CLR_S  30
/* DSPI_MEM_DQS1_AFIFO_OVF_INT_CLR : WT ;bitpos:[29] ;default: 1'b0 ; */
/*description: The clear bit for SPI_MEM_DQS1_AFIFO_OVF_INT interrupt..*/
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_CLR    (BIT(29))
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_CLR_M  (BIT(29))
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_CLR_V  0x1
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_CLR_S  29
/* DSPI_MEM_DQS0_AFIFO_OVF_INT_CLR : WT ;bitpos:[28] ;default: 1'b0 ; */
/*description: The clear bit for SPI_MEM_DQS0_AFIFO_OVF_INT interrupt..*/
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_CLR    (BIT(28))
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_CLR_M  (BIT(28))
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_CLR_V  0x1
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_CLR_S  28
/* DSPI_MEM_AXI_WADDR_ERR_INT_CLR : WT ;bitpos:[9] ;default: 1'b0 ; */
/*description: The clear bit for SPI_MEM_AXI_WADDR_ERR_INT interrupt..*/
#define DSPI_MEM_AXI_WADDR_ERR_INT_CLR    (BIT(9))
#define DSPI_MEM_AXI_WADDR_ERR_INT_CLR_M  (BIT(9))
#define DSPI_MEM_AXI_WADDR_ERR_INT_CLR_V  0x1
#define DSPI_MEM_AXI_WADDR_ERR_INT_CLR_S  9
/* DSPI_MEM_AXI_WR_FLASH_ERR_INT_CLR : WT ;bitpos:[8] ;default: 1'b0 ; */
/*description: The clear bit for SPI_MEM_AXI_WR_FALSH_ERR_INT interrupt..*/
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_CLR    (BIT(8))
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_CLR_M  (BIT(8))
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_CLR_V  0x1
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_CLR_S  8
/* DSPI_MEM_AXI_RADDR_ERR_INT_CLR : WT ;bitpos:[7] ;default: 1'b0 ; */
/*description: The clear bit for SPI_MEM_AXI_RADDR_ERR_INT interrupt..*/
#define DSPI_MEM_AXI_RADDR_ERR_INT_CLR    (BIT(7))
#define DSPI_MEM_AXI_RADDR_ERR_INT_CLR_M  (BIT(7))
#define DSPI_MEM_AXI_RADDR_ERR_INT_CLR_V  0x1
#define DSPI_MEM_AXI_RADDR_ERR_INT_CLR_S  7
/* DSPI_MEM_PMS_REJECT_INT_CLR : WT ;bitpos:[6] ;default: 1'b0 ; */
/*description: The clear bit for SPI_MEM_PMS_REJECT_INT interrupt..*/
#define DSPI_MEM_PMS_REJECT_INT_CLR    (BIT(6))
#define DSPI_MEM_PMS_REJECT_INT_CLR_M  (BIT(6))
#define DSPI_MEM_PMS_REJECT_INT_CLR_V  0x1
#define DSPI_MEM_PMS_REJECT_INT_CLR_S  6
/* DSPI_MEM_ECC_ERR_INT_CLR : WT ;bitpos:[5] ;default: 1'b0 ; */
/*description: The clear bit for SPI_MEM_ECC_ERR_INT interrupt..*/
#define DSPI_MEM_ECC_ERR_INT_CLR    (BIT(5))
#define DSPI_MEM_ECC_ERR_INT_CLR_M  (BIT(5))
#define DSPI_MEM_ECC_ERR_INT_CLR_V  0x1
#define DSPI_MEM_ECC_ERR_INT_CLR_S  5
/* DSPI_MEM_MST_ST_END_INT_CLR : WT ;bitpos:[4] ;default: 1'b0 ; */
/*description: The clear bit for SPI_MEM_MST_ST_END_INT interrupt..*/
#define DSPI_MEM_MST_ST_END_INT_CLR    (BIT(4))
#define DSPI_MEM_MST_ST_END_INT_CLR_M  (BIT(4))
#define DSPI_MEM_MST_ST_END_INT_CLR_V  0x1
#define DSPI_MEM_MST_ST_END_INT_CLR_S  4
/* DSPI_MEM_SLV_ST_END_INT_CLR : WT ;bitpos:[3] ;default: 1'b0 ; */
/*description: The clear bit for SPI_MEM_SLV_ST_END_INT interrupt..*/
#define DSPI_MEM_SLV_ST_END_INT_CLR    (BIT(3))
#define DSPI_MEM_SLV_ST_END_INT_CLR_M  (BIT(3))
#define DSPI_MEM_SLV_ST_END_INT_CLR_V  0x1
#define DSPI_MEM_SLV_ST_END_INT_CLR_S  3

