espressif/esp-idf/components/soc/esp32p4/include/soc/dspi_mem_reg.h
#define DSPI_MEM_INT_RAW_REG          (DR_REG_DSPI_MEM_BASE + 0xC8)
/* DSPI_MEM_BUS_FIFO0_UDF_INT_RAW : R/WTC/SS ;bitpos:[31] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MEM_BUS_FIFO0_UDF_INT interrupt. 1: Triggered when BUS0 FIFO
 is underflow..*/
#define DSPI_MEM_BUS_FIFO0_UDF_INT_RAW    (BIT(31))
#define DSPI_MEM_BUS_FIFO0_UDF_INT_RAW_M  (BIT(31))
#define DSPI_MEM_BUS_FIFO0_UDF_INT_RAW_V  0x1
#define DSPI_MEM_BUS_FIFO0_UDF_INT_RAW_S  31
/* DSPI_MEM_BUS_FIFO1_UDF_INT_RAW : R/WTC/SS ;bitpos:[30] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MEM_BUS_FIFO1_UDF_INT interrupt. 1: Triggered when BUS1 FIFO
 is underflow..*/
#define DSPI_MEM_BUS_FIFO1_UDF_INT_RAW    (BIT(30))
#define DSPI_MEM_BUS_FIFO1_UDF_INT_RAW_M  (BIT(30))
#define DSPI_MEM_BUS_FIFO1_UDF_INT_RAW_V  0x1
#define DSPI_MEM_BUS_FIFO1_UDF_INT_RAW_S  30
/* DSPI_MEM_DQS1_AFIFO_OVF_INT_RAW : R/WTC/SS ;bitpos:[29] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MEM_DQS1_AFIFO_OVF_INT interrupt. 1: Triggered when the AFIF
O connected to SPI_DQS is overflow..*/
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_RAW    (BIT(29))
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_RAW_M  (BIT(29))
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_RAW_V  0x1
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_RAW_S  29
/* DSPI_MEM_DQS0_AFIFO_OVF_INT_RAW : R/WTC/SS ;bitpos:[28] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MEM_DQS0_AFIFO_OVF_INT interrupt. 1: Triggered when the AFIF
O connected to SPI_DQS1 is overflow..*/
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_RAW    (BIT(28))
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_RAW_M  (BIT(28))
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_RAW_V  0x1
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_RAW_S  28
/* DSPI_MEM_AXI_WADDR_ERR_INT_RAW : R/WTC/SS ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MEM_AXI_WADDR_ERR_INT interrupt. 1: Triggered when AXI write
 address is invalid by compared to MMU configuration. 0: Others..*/
#define DSPI_MEM_AXI_WADDR_ERR_INT_RAW    (BIT(9))
#define DSPI_MEM_AXI_WADDR_ERR_INT_RAW_M  (BIT(9))
#define DSPI_MEM_AXI_WADDR_ERR_INT_RAW_V  0x1
#define DSPI_MEM_AXI_WADDR_ERR_INT_RAW_S  9
/* DSPI_MEM_AXI_WR_FLASH_ERR_INT_RAW : R/WTC/SS ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MEM_AXI_WR_FALSH_ERR_INT interrupt. 1: Triggered when AXI wr
ite flash request is received. 0: Others..*/
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_RAW    (BIT(8))
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_RAW_M  (BIT(8))
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_RAW_V  0x1
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_RAW_S  8
/* DSPI_MEM_AXI_RADDR_ERR_INT_RAW : R/WTC/SS ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MEM_AXI_RADDR_ERR_INT interrupt. 1: Triggered when AXI read
address is invalid by compared to MMU configuration. 0: Others..*/
#define DSPI_MEM_AXI_RADDR_ERR_INT_RAW    (BIT(7))
#define DSPI_MEM_AXI_RADDR_ERR_INT_RAW_M  (BIT(7))
#define DSPI_MEM_AXI_RADDR_ERR_INT_RAW_V  0x1
#define DSPI_MEM_AXI_RADDR_ERR_INT_RAW_S  7
/* DSPI_MEM_PMS_REJECT_INT_RAW : R/WTC/SS ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MEM_PMS_REJECT_INT interrupt. 1: Triggered when SPI1 access
is rejected. 0: Others..*/
#define DSPI_MEM_PMS_REJECT_INT_RAW    (BIT(6))
#define DSPI_MEM_PMS_REJECT_INT_RAW_M  (BIT(6))
#define DSPI_MEM_PMS_REJECT_INT_RAW_V  0x1
#define DSPI_MEM_PMS_REJECT_INT_RAW_S  6
/* DSPI_MEM_ECC_ERR_INT_RAW : R/WTC/SS ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MEM_ECC_ERR_INT interrupt. When SPI_FMEM_ECC_ERR_INT_EN is s
et and  SPI_SMEM_ECC_ERR_INT_EN is cleared, this bit is triggered when the error
 times of SPI0/1 ECC read flash are equal or bigger than SPI_MEM_ECC_ERR_INT_NUM
. When SPI_FMEM_ECC_ERR_INT_EN is cleared and  SPI_SMEM_ECC_ERR_INT_EN is set, t
his bit is triggered when the error times of SPI0/1 ECC read external RAM are eq
ual or bigger than SPI_MEM_ECC_ERR_INT_NUM. When SPI_FMEM_ECC_ERR_INT_EN and  SP
I_SMEM_ECC_ERR_INT_EN are set, this bit is triggered when the total error times
of SPI0/1 ECC read external RAM and flash are equal or bigger than SPI_MEM_ECC_E
RR_INT_NUM. When SPI_FMEM_ECC_ERR_INT_EN and  SPI_SMEM_ECC_ERR_INT_EN are cleare
d, this bit will not be triggered..*/
#define DSPI_MEM_ECC_ERR_INT_RAW    (BIT(5))
#define DSPI_MEM_ECC_ERR_INT_RAW_M  (BIT(5))
#define DSPI_MEM_ECC_ERR_INT_RAW_V  0x1
#define DSPI_MEM_ECC_ERR_INT_RAW_S  5
/* DSPI_MEM_MST_ST_END_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MEM_MST_ST_END_INT interrupt. 1: Triggered when spi0_mst_st
is changed from non idle state to idle state. 0: Others..*/
#define DSPI_MEM_MST_ST_END_INT_RAW    (BIT(4))
#define DSPI_MEM_MST_ST_END_INT_RAW_M  (BIT(4))
#define DSPI_MEM_MST_ST_END_INT_RAW_V  0x1
#define DSPI_MEM_MST_ST_END_INT_RAW_S  4
/* DSPI_MEM_SLV_ST_END_INT_RAW : R/WTC/SS ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MEM_SLV_ST_END_INT interrupt. 1: Triggered when spi0_slv_st
is changed from non idle state to idle state. It means that SPI_CS raises high.
0: Others.*/
#define DSPI_MEM_SLV_ST_END_INT_RAW    (BIT(3))
#define DSPI_MEM_SLV_ST_END_INT_RAW_M  (BIT(3))
#define DSPI_MEM_SLV_ST_END_INT_RAW_V  0x1
#define DSPI_MEM_SLV_ST_END_INT_RAW_S  3

#define DSPI_MEM_INT_ST_REG          (DR_REG_DSPI_MEM_BASE + 0xCC)
/* DSPI_MEM_BUS_FIFO0_UDF_INT_ST : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_BUS_FIFO0_UDF_INT interrupt..*/
#define DSPI_MEM_BUS_FIFO0_UDF_INT_ST    (BIT(31))
#define DSPI_MEM_BUS_FIFO0_UDF_INT_ST_M  (BIT(31))
#define DSPI_MEM_BUS_FIFO0_UDF_INT_ST_V  0x1
#define DSPI_MEM_BUS_FIFO0_UDF_INT_ST_S  31
/* DSPI_MEM_BUS_FIFO1_UDF_INT_ST : RO ;bitpos:[30] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_BUS_FIFO1_UDF_INT interrupt..*/
#define DSPI_MEM_BUS_FIFO1_UDF_INT_ST    (BIT(30))
#define DSPI_MEM_BUS_FIFO1_UDF_INT_ST_M  (BIT(30))
#define DSPI_MEM_BUS_FIFO1_UDF_INT_ST_V  0x1
#define DSPI_MEM_BUS_FIFO1_UDF_INT_ST_S  30
/* DSPI_MEM_DQS1_AFIFO_OVF_INT_ST : RO ;bitpos:[29] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_DQS1_AFIFO_OVF_INT interrupt..*/
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_ST    (BIT(29))
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_ST_M  (BIT(29))
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_ST_V  0x1
#define DSPI_MEM_DQS1_AFIFO_OVF_INT_ST_S  29
/* DSPI_MEM_DQS0_AFIFO_OVF_INT_ST : RO ;bitpos:[28] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_DQS0_AFIFO_OVF_INT interrupt..*/
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_ST    (BIT(28))
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_ST_M  (BIT(28))
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_ST_V  0x1
#define DSPI_MEM_DQS0_AFIFO_OVF_INT_ST_S  28
/* DSPI_MEM_AXI_WADDR_ERR_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_AXI_WADDR_ERR_INT interrupt..*/
#define DSPI_MEM_AXI_WADDR_ERR_INT_ST    (BIT(9))
#define DSPI_MEM_AXI_WADDR_ERR_INT_ST_M  (BIT(9))
#define DSPI_MEM_AXI_WADDR_ERR_INT_ST_V  0x1
#define DSPI_MEM_AXI_WADDR_ERR_INT_ST_S  9
/* DSPI_MEM_AXI_WR_FLASH_ERR_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_AXI_WR_FALSH_ERR_INT interrupt..*/
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_ST    (BIT(8))
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_ST_M  (BIT(8))
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_ST_V  0x1
#define DSPI_MEM_AXI_WR_FLASH_ERR_INT_ST_S  8
/* DSPI_MEM_AXI_RADDR_ERR_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The enable bit for SPI_MEM_AXI_RADDR_ERR_INT interrupt..*/
#define DSPI_MEM_AXI_RADDR_ERR_INT_ST    (BIT(7))
#define DSPI_MEM_AXI_RADDR_ERR_INT_ST_M  (BIT(7))
#define DSPI_MEM_AXI_RADDR_ERR_INT_ST_V  0x1
#define DSPI_MEM_AXI_RADDR_ERR_INT_ST_S  7
/* DSPI_MEM_PMS_REJECT_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_PMS_REJECT_INT interrupt..*/
#define DSPI_MEM_PMS_REJECT_INT_ST    (BIT(6))
#define DSPI_MEM_PMS_REJECT_INT_ST_M  (BIT(6))
#define DSPI_MEM_PMS_REJECT_INT_ST_V  0x1
#define DSPI_MEM_PMS_REJECT_INT_ST_S  6
/* DSPI_MEM_ECC_ERR_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_ECC_ERR_INT interrupt..*/
#define DSPI_MEM_ECC_ERR_INT_ST    (BIT(5))
#define DSPI_MEM_ECC_ERR_INT_ST_M  (BIT(5))
#define DSPI_MEM_ECC_ERR_INT_ST_V  0x1
#define DSPI_MEM_ECC_ERR_INT_ST_S  5
/* DSPI_MEM_MST_ST_END_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_MST_ST_END_INT interrupt..*/
#define DSPI_MEM_MST_ST_END_INT_ST    (BIT(4))
#define DSPI_MEM_MST_ST_END_INT_ST_M  (BIT(4))
#define DSPI_MEM_MST_ST_END_INT_ST_V  0x1
#define DSPI_MEM_MST_ST_END_INT_ST_S  4
/* DSPI_MEM_SLV_ST_END_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The status bit for SPI_MEM_SLV_ST_END_INT interrupt..*/
#define DSPI_MEM_SLV_ST_END_INT_ST    (BIT(3))
#define DSPI_MEM_SLV_ST_END_INT_ST_M  (BIT(3))
#define DSPI_MEM_SLV_ST_END_INT_ST_V  0x1
#define DSPI_MEM_SLV_ST_END_INT_ST_S  3

#define DSPI_MEM_DDR_REG          (DR_REG_DSPI_MEM_BASE + 0xD4)
/* DSPI_FMEM_HYPERBUS_CA : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: Set this bit to enable HyperRAM address out when accesses to flash, which means
ADDR_OUT[31:0] = {spi_usr_addr_value[19:4], 13'd0, spi_usr_addr_value[3:1]}..*/
#define DSPI_FMEM_HYPERBUS_CA    (BIT(30))
#define DSPI_FMEM_HYPERBUS_CA_M  (BIT(30))
#define DSPI_FMEM_HYPERBUS_CA_V  0x1
#define DSPI_FMEM_HYPERBUS_CA_S  30
/* DSPI_FMEM_OCTA_RAM_ADDR : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: Set this bit to enable octa_ram address out when accesses to flash, which means
ADDR_OUT[31:0] = {spi_usr_addr_value[25:4], 6'd0, spi_usr_addr_value[3:1], 1'b0}
..*/
#define DSPI_FMEM_OCTA_RAM_ADDR    (BIT(29))
#define DSPI_FMEM_OCTA_RAM_ADDR_M  (BIT(29))
#define DSPI_FMEM_OCTA_RAM_ADDR_V  0x1
#define DSPI_FMEM_OCTA_RAM_ADDR_S  29
/* DSPI_FMEM_CLK_DIFF_INV : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: Set this bit to invert SPI_DIFF when accesses to flash. ..*/
#define DSPI_FMEM_CLK_DIFF_INV    (BIT(28))
#define DSPI_FMEM_CLK_DIFF_INV_M  (BIT(28))
#define DSPI_FMEM_CLK_DIFF_INV_V  0x1
#define DSPI_FMEM_CLK_DIFF_INV_S  28
/* DSPI_FMEM_HYPERBUS_DUMMY_2X : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: Set this bit to enable the vary dummy function in SPI HyperBus mode, when SPI0 a
ccesses flash or SPI1 accesses flash or sram..*/
#define DSPI_FMEM_HYPERBUS_DUMMY_2X    (BIT(27))
#define DSPI_FMEM_HYPERBUS_DUMMY_2X_M  (BIT(27))
#define DSPI_FMEM_HYPERBUS_DUMMY_2X_V  0x1
#define DSPI_FMEM_HYPERBUS_DUMMY_2X_S  27
/* DSPI_FMEM_DQS_CA_IN : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: Set this bit to enable the input of SPI_DQS signal in SPI phases of CMD and ADDR
..*/
#define DSPI_FMEM_DQS_CA_IN    (BIT(26))
#define DSPI_FMEM_DQS_CA_IN_M  (BIT(26))
#define DSPI_FMEM_DQS_CA_IN_V  0x1
#define DSPI_FMEM_DQS_CA_IN_S  26
/* DSPI_FMEM_CLK_DIFF_EN : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: Set this bit to enable the differential SPI_CLK#..*/
#define DSPI_FMEM_CLK_DIFF_EN    (BIT(24))
#define DSPI_FMEM_CLK_DIFF_EN_M  (BIT(24))
#define DSPI_FMEM_CLK_DIFF_EN_V  0x1
#define DSPI_FMEM_CLK_DIFF_EN_S  24
/* DSPI_FMEM_DDR_DQS_LOOP : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: 1: Do not need the input of SPI_DQS signal, SPI0 starts to receive data when spi
0_slv_st is in SPI_MEM_DIN state. It is used when there is no SPI_DQS signal or
SPI_DQS signal is not stable. 0: SPI0 starts to store data at the positive and n
egative edge of SPI_DQS..*/
#define DSPI_FMEM_DDR_DQS_LOOP    (BIT(21))
#define DSPI_FMEM_DDR_DQS_LOOP_M  (BIT(21))
#define DSPI_FMEM_DDR_DQS_LOOP_V  0x1
#define DSPI_FMEM_DDR_DQS_LOOP_S  21
/* DSPI_FMEM_USR_DDR_DQS_THD : R/W ;bitpos:[20:14] ;default: 7'b0 ; */
/*description: The delay number of data strobe which from memory based on SPI clock..*/
#define DSPI_FMEM_USR_DDR_DQS_THD    0x0000007F
#define DSPI_FMEM_USR_DDR_DQS_THD_M  ((DSPI_FMEM_USR_DDR_DQS_THD_V)<<(DSPI_FMEM_USR_DDR_DQS_THD_S))
#define DSPI_FMEM_USR_DDR_DQS_THD_V  0x7F
#define DSPI_FMEM_USR_DDR_DQS_THD_S  14
/* DSPI_FMEM_RX_DDR_MSK_EN : R/W ;bitpos:[13] ;default: 1'h1 ; */
/*description: Set this bit to mask the first or the last byte in SPI0 ECC DDR read mode, when
accesses to flash..*/
#define DSPI_FMEM_RX_DDR_MSK_EN    (BIT(13))
#define DSPI_FMEM_RX_DDR_MSK_EN_M  (BIT(13))
#define DSPI_FMEM_RX_DDR_MSK_EN_V  0x1
#define DSPI_FMEM_RX_DDR_MSK_EN_S  13
/* DSPI_FMEM_TX_DDR_MSK_EN : R/W ;bitpos:[12] ;default: 1'h1 ; */
/*description: Set this bit to mask the first or the last byte in SPI0 ECC DDR write mode, when
 accesses to flash..*/
#define DSPI_FMEM_TX_DDR_MSK_EN    (BIT(12))
#define DSPI_FMEM_TX_DDR_MSK_EN_M  (BIT(12))
#define DSPI_FMEM_TX_DDR_MSK_EN_V  0x1
#define DSPI_FMEM_TX_DDR_MSK_EN_S  12
/* DSPI_FMEM_OUTMINBYTELEN : R/W ;bitpos:[11:5] ;default: 7'b1 ; */
/*description: It is the minimum output data length in the panda device..*/
#define DSPI_FMEM_OUTMINBYTELEN    0x0000007F
#define DSPI_FMEM_OUTMINBYTELEN_M  ((DSPI_FMEM_OUTMINBYTELEN_V)<<(DSPI_FMEM_OUTMINBYTELEN_S))
#define DSPI_FMEM_OUTMINBYTELEN_V  0x7F
#define DSPI_FMEM_OUTMINBYTELEN_S  5
/* DSPI_FMEM_DDR_CMD_DIS : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: the bit is used to disable dual edge in command phase when DDR mode..*/
#define DSPI_FMEM_DDR_CMD_DIS    (BIT(4))
#define DSPI_FMEM_DDR_CMD_DIS_M  (BIT(4))
#define DSPI_FMEM_DDR_CMD_DIS_V  0x1
#define DSPI_FMEM_DDR_CMD_DIS_S  4
/* DSPI_FMEM_DDR_WDAT_SWP : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set the bit to reorder tx data of the word in spi DDR mode..*/
#define DSPI_FMEM_DDR_WDAT_SWP    (BIT(3))
#define DSPI_FMEM_DDR_WDAT_SWP_M  (BIT(3))
#define DSPI_FMEM_DDR_WDAT_SWP_V  0x1
#define DSPI_FMEM_DDR_WDAT_SWP_S  3
/* DSPI_FMEM_DDR_RDAT_SWP : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set the bit to reorder rx data of the word in spi DDR mode..*/
#define DSPI_FMEM_DDR_RDAT_SWP    (BIT(2))
#define DSPI_FMEM_DDR_RDAT_SWP_M  (BIT(2))
#define DSPI_FMEM_DDR_RDAT_SWP_V  0x1
#define DSPI_FMEM_DDR_RDAT_SWP_S  2
/* DSPI_FMEM_VAR_DUMMY : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set the bit to enable variable dummy cycle in spi DDR mode..*/
#define DSPI_FMEM_VAR_DUMMY    (BIT(1))
#define DSPI_FMEM_VAR_DUMMY_M  (BIT(1))
#define DSPI_FMEM_VAR_DUMMY_V  0x1
#define DSPI_FMEM_VAR_DUMMY_S  1
/* DSPI_FMEM_DDR_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: 1: in DDR mode,  0 in SDR mode.*/
#define DSPI_FMEM_DDR_EN    (BIT(0))
#define DSPI_FMEM_DDR_EN_M  (BIT(0))
#define DSPI_FMEM_DDR_EN_V  0x1
#define DSPI_FMEM_DDR_EN_S  0

#define DSPI_SMEM_DDR_REG          (DR_REG_DSPI_MEM_BASE + 0xD8)
/* DSPI_SMEM_HYPERBUS_CA : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: Set this bit to enable HyperRAM address out when accesses to external RAM, which
 means ADDR_OUT[31:0] = {spi_usr_addr_value[19:4], 13'd0, spi_usr_addr_value[3:1
]}..*/
#define DSPI_SMEM_HYPERBUS_CA    (BIT(30))
#define DSPI_SMEM_HYPERBUS_CA_M  (BIT(30))
#define DSPI_SMEM_HYPERBUS_CA_V  0x1
#define DSPI_SMEM_HYPERBUS_CA_S  30
/* DSPI_SMEM_OCTA_RAM_ADDR : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: Set this bit to enable octa_ram address out when accesses to external RAM, which
 means ADDR_OUT[31:0] = {spi_usr_addr_value[25:4], 6'd0, spi_usr_addr_value[3:1]
, 1'b0}..*/
#define DSPI_SMEM_OCTA_RAM_ADDR    (BIT(29))
#define DSPI_SMEM_OCTA_RAM_ADDR_M  (BIT(29))
#define DSPI_SMEM_OCTA_RAM_ADDR_V  0x1
#define DSPI_SMEM_OCTA_RAM_ADDR_S  29
/* DSPI_SMEM_CLK_DIFF_INV : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: Set this bit to invert SPI_DIFF when accesses to external RAM. ..*/
#define DSPI_SMEM_CLK_DIFF_INV    (BIT(28))
#define DSPI_SMEM_CLK_DIFF_INV_M  (BIT(28))
#define DSPI_SMEM_CLK_DIFF_INV_V  0x1
#define DSPI_SMEM_CLK_DIFF_INV_S  28
/* DSPI_SMEM_HYPERBUS_DUMMY_2X : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: Set this bit to enable the vary dummy function in SPI HyperBus mode, when SPI0 a
ccesses flash or SPI1 accesses flash or sram..*/
#define DSPI_SMEM_HYPERBUS_DUMMY_2X    (BIT(27))
#define DSPI_SMEM_HYPERBUS_DUMMY_2X_M  (BIT(27))
#define DSPI_SMEM_HYPERBUS_DUMMY_2X_V  0x1
#define DSPI_SMEM_HYPERBUS_DUMMY_2X_S  27
/* DSPI_SMEM_DQS_CA_IN : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: Set this bit to enable the input of SPI_DQS signal in SPI phases of CMD and ADDR
..*/
#define DSPI_SMEM_DQS_CA_IN    (BIT(26))
#define DSPI_SMEM_DQS_CA_IN_M  (BIT(26))
#define DSPI_SMEM_DQS_CA_IN_V  0x1
#define DSPI_SMEM_DQS_CA_IN_S  26
/* DSPI_SMEM_CLK_DIFF_EN : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: Set this bit to enable the differential SPI_CLK#..*/
#define DSPI_SMEM_CLK_DIFF_EN    (BIT(24))
#define DSPI_SMEM_CLK_DIFF_EN_M  (BIT(24))
#define DSPI_SMEM_CLK_DIFF_EN_V  0x1
#define DSPI_SMEM_CLK_DIFF_EN_S  24
/* DSPI_SMEM_DDR_DQS_LOOP : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: 1: Do not need the input of SPI_DQS signal, SPI0 starts to receive data when spi
0_slv_st is in SPI_MEM_DIN state. It is used when there is no SPI_DQS signal or
SPI_DQS signal is not stable. 0: SPI0 starts to store data at the positive and n
egative edge of SPI_DQS..*/
#define DSPI_SMEM_DDR_DQS_LOOP    (BIT(21))
#define DSPI_SMEM_DDR_DQS_LOOP_M  (BIT(21))
#define DSPI_SMEM_DDR_DQS_LOOP_V  0x1
#define DSPI_SMEM_DDR_DQS_LOOP_S  21
/* DSPI_SMEM_USR_DDR_DQS_THD : R/W ;bitpos:[20:14] ;default: 7'b0 ; */
/*description: The delay number of data strobe which from memory based on SPI clock..*/
#define DSPI_SMEM_USR_DDR_DQS_THD    0x0000007F
#define DSPI_SMEM_USR_DDR_DQS_THD_M  ((DSPI_SMEM_USR_DDR_DQS_THD_V)<<(DSPI_SMEM_USR_DDR_DQS_THD_S))
#define DSPI_SMEM_USR_DDR_DQS_THD_V  0x7F
#define DSPI_SMEM_USR_DDR_DQS_THD_S  14
/* DSPI_SMEM_RX_DDR_MSK_EN : R/W ;bitpos:[13] ;default: 1'h1 ; */
/*description: Set this bit to mask the first or the last byte in SPI0 ECC DDR read mode, when
accesses to external RAM..*/
#define DSPI_SMEM_RX_DDR_MSK_EN    (BIT(13))
#define DSPI_SMEM_RX_DDR_MSK_EN_M  (BIT(13))
#define DSPI_SMEM_RX_DDR_MSK_EN_V  0x1
#define DSPI_SMEM_RX_DDR_MSK_EN_S  13
/* DSPI_SMEM_TX_DDR_MSK_EN : R/W ;bitpos:[12] ;default: 1'h1 ; */
/*description: Set this bit to mask the first or the last byte in SPI0 ECC DDR write mode, when
 accesses to external RAM..*/
#define DSPI_SMEM_TX_DDR_MSK_EN    (BIT(12))
#define DSPI_SMEM_TX_DDR_MSK_EN_M  (BIT(12))
#define DSPI_SMEM_TX_DDR_MSK_EN_V  0x1
#define DSPI_SMEM_TX_DDR_MSK_EN_S  12
/* DSPI_SMEM_OUTMINBYTELEN : R/W ;bitpos:[11:5] ;default: 7'b1 ; */
/*description: It is the minimum output data length in the DDR psram..*/
#define DSPI_SMEM_OUTMINBYTELEN    0x0000007F
#define DSPI_SMEM_OUTMINBYTELEN_M  ((DSPI_SMEM_OUTMINBYTELEN_V)<<(DSPI_SMEM_OUTMINBYTELEN_S))
#define DSPI_SMEM_OUTMINBYTELEN_V  0x7F
#define DSPI_SMEM_OUTMINBYTELEN_S  5
/* DSPI_SMEM_DDR_CMD_DIS : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: the bit is used to disable dual edge in command phase when DDR mode..*/
#define DSPI_SMEM_DDR_CMD_DIS    (BIT(4))
#define DSPI_SMEM_DDR_CMD_DIS_M  (BIT(4))
#define DSPI_SMEM_DDR_CMD_DIS_V  0x1
#define DSPI_SMEM_DDR_CMD_DIS_S  4
/* DSPI_SMEM_DDR_WDAT_SWP : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set the bit to reorder tx data of the word in spi DDR mode..*/
#define DSPI_SMEM_DDR_WDAT_SWP    (BIT(3))
#define DSPI_SMEM_DDR_WDAT_SWP_M  (BIT(3))
#define DSPI_SMEM_DDR_WDAT_SWP_V  0x1
#define DSPI_SMEM_DDR_WDAT_SWP_S  3
/* DSPI_SMEM_DDR_RDAT_SWP : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set the bit to reorder rx data of the word in spi DDR mode..*/
#define DSPI_SMEM_DDR_RDAT_SWP    (BIT(2))
#define DSPI_SMEM_DDR_RDAT_SWP_M  (BIT(2))
#define DSPI_SMEM_DDR_RDAT_SWP_V  0x1
#define DSPI_SMEM_DDR_RDAT_SWP_S  2
/* DSPI_SMEM_VAR_DUMMY : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set the bit to enable variable dummy cycle in spi DDR mode..*/
#define DSPI_SMEM_VAR_DUMMY    (BIT(1))
#define DSPI_SMEM_VAR_DUMMY_M  (BIT(1))
#define DSPI_SMEM_VAR_DUMMY_V  0x1
#define DSPI_SMEM_VAR_DUMMY_S  1
/* DSPI_SMEM_DDR_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: 1: in DDR mode,  0 in SDR mode.*/
#define DSPI_SMEM_DDR_EN    (BIT(0))
#define DSPI_SMEM_DDR_EN_M  (BIT(0))
#define DSPI_SMEM_DDR_EN_V  0x1
#define DSPI_SMEM_DDR_EN_S  0

#define DSPI_FMEM_PMS0_ATTR_REG          (DR_REG_DSPI_MEM_BASE + 0x100)
/* DSPI_FMEM_PMS0_ECC : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: SPI1 flash PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. The flash
 PMS section $n is configured by registers SPI_FMEM_PMS$n_ADDR_REG and SPI_FMEM_
PMS$n_SIZE_REG..*/
#define DSPI_FMEM_PMS0_ECC    (BIT(2))
#define DSPI_FMEM_PMS0_ECC_M  (BIT(2))
#define DSPI_FMEM_PMS0_ECC_V  0x1
#define DSPI_FMEM_PMS0_ECC_S  2
/* DSPI_FMEM_PMS0_WR_ATTR : R/W ;bitpos:[1] ;default: 1'h1 ; */
/*description: 1: SPI1 flash PMS section $n write accessible. 0: Not allowed..*/
#define DSPI_FMEM_PMS0_WR_ATTR    (BIT(1))
#define DSPI_FMEM_PMS0_WR_ATTR_M  (BIT(1))
#define DSPI_FMEM_PMS0_WR_ATTR_V  0x1
#define DSPI_FMEM_PMS0_WR_ATTR_S  1
/* DSPI_FMEM_PMS0_RD_ATTR : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: 1: SPI1 flash PMS section $n read accessible. 0: Not allowed..*/
#define DSPI_FMEM_PMS0_RD_ATTR    (BIT(0))
#define DSPI_FMEM_PMS0_RD_ATTR_M  (BIT(0))
#define DSPI_FMEM_PMS0_RD_ATTR_V  0x1
#define DSPI_FMEM_PMS0_RD_ATTR_S  0

