espressif/esp-idf/components/soc/esp32p4/include/soc/dspi_mem_reg.h
#define DSPI_FMEM_PMS1_ATTR_REG          (DR_REG_DSPI_MEM_BASE + 0x104)
/* DSPI_FMEM_PMS1_ECC : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: SPI1 flash PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. The flash
 PMS section $n is configured by registers SPI_FMEM_PMS$n_ADDR_REG and SPI_FMEM_
PMS$n_SIZE_REG..*/
#define DSPI_FMEM_PMS1_ECC    (BIT(2))
#define DSPI_FMEM_PMS1_ECC_M  (BIT(2))
#define DSPI_FMEM_PMS1_ECC_V  0x1
#define DSPI_FMEM_PMS1_ECC_S  2
/* DSPI_FMEM_PMS1_WR_ATTR : R/W ;bitpos:[1] ;default: 1'h1 ; */
/*description: 1: SPI1 flash PMS section $n write accessible. 0: Not allowed..*/
#define DSPI_FMEM_PMS1_WR_ATTR    (BIT(1))
#define DSPI_FMEM_PMS1_WR_ATTR_M  (BIT(1))
#define DSPI_FMEM_PMS1_WR_ATTR_V  0x1
#define DSPI_FMEM_PMS1_WR_ATTR_S  1
/* DSPI_FMEM_PMS1_RD_ATTR : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: 1: SPI1 flash PMS section $n read accessible. 0: Not allowed..*/
#define DSPI_FMEM_PMS1_RD_ATTR    (BIT(0))
#define DSPI_FMEM_PMS1_RD_ATTR_M  (BIT(0))
#define DSPI_FMEM_PMS1_RD_ATTR_V  0x1
#define DSPI_FMEM_PMS1_RD_ATTR_S  0

#define DSPI_FMEM_PMS2_ATTR_REG          (DR_REG_DSPI_MEM_BASE + 0x108)
/* DSPI_FMEM_PMS2_ECC : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: SPI1 flash PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. The flash
 PMS section $n is configured by registers SPI_FMEM_PMS$n_ADDR_REG and SPI_FMEM_
PMS$n_SIZE_REG..*/
#define DSPI_FMEM_PMS2_ECC    (BIT(2))
#define DSPI_FMEM_PMS2_ECC_M  (BIT(2))
#define DSPI_FMEM_PMS2_ECC_V  0x1
#define DSPI_FMEM_PMS2_ECC_S  2
/* DSPI_FMEM_PMS2_WR_ATTR : R/W ;bitpos:[1] ;default: 1'h1 ; */
/*description: 1: SPI1 flash PMS section $n write accessible. 0: Not allowed..*/
#define DSPI_FMEM_PMS2_WR_ATTR    (BIT(1))
#define DSPI_FMEM_PMS2_WR_ATTR_M  (BIT(1))
#define DSPI_FMEM_PMS2_WR_ATTR_V  0x1
#define DSPI_FMEM_PMS2_WR_ATTR_S  1
/* DSPI_FMEM_PMS2_RD_ATTR : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: 1: SPI1 flash PMS section $n read accessible. 0: Not allowed..*/
#define DSPI_FMEM_PMS2_RD_ATTR    (BIT(0))
#define DSPI_FMEM_PMS2_RD_ATTR_M  (BIT(0))
#define DSPI_FMEM_PMS2_RD_ATTR_V  0x1
#define DSPI_FMEM_PMS2_RD_ATTR_S  0

#define DSPI_FMEM_PMS3_ATTR_REG          (DR_REG_DSPI_MEM_BASE + 0x10C)
/* DSPI_FMEM_PMS3_ECC : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: SPI1 flash PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. The flash
 PMS section $n is configured by registers SPI_FMEM_PMS$n_ADDR_REG and SPI_FMEM_
PMS$n_SIZE_REG..*/
#define DSPI_FMEM_PMS3_ECC    (BIT(2))
#define DSPI_FMEM_PMS3_ECC_M  (BIT(2))
#define DSPI_FMEM_PMS3_ECC_V  0x1
#define DSPI_FMEM_PMS3_ECC_S  2
/* DSPI_FMEM_PMS3_WR_ATTR : R/W ;bitpos:[1] ;default: 1'h1 ; */
/*description: 1: SPI1 flash PMS section $n write accessible. 0: Not allowed..*/
#define DSPI_FMEM_PMS3_WR_ATTR    (BIT(1))
#define DSPI_FMEM_PMS3_WR_ATTR_M  (BIT(1))
#define DSPI_FMEM_PMS3_WR_ATTR_V  0x1
#define DSPI_FMEM_PMS3_WR_ATTR_S  1
/* DSPI_FMEM_PMS3_RD_ATTR : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: 1: SPI1 flash PMS section $n read accessible. 0: Not allowed..*/
#define DSPI_FMEM_PMS3_RD_ATTR    (BIT(0))
#define DSPI_FMEM_PMS3_RD_ATTR_M  (BIT(0))
#define DSPI_FMEM_PMS3_RD_ATTR_V  0x1
#define DSPI_FMEM_PMS3_RD_ATTR_S  0

#define DSPI_FMEM_PMS0_ADDR_REG          (DR_REG_DSPI_MEM_BASE + 0x110)
/* DSPI_FMEM_PMS0_ADDR_S : R/W ;bitpos:[25:0] ;default: 26'h0 ; */
/*description: SPI1 flash PMS section $n start address value.*/
#define DSPI_FMEM_PMS0_ADDR_S    0x03FFFFFF
#define DSPI_FMEM_PMS0_ADDR_S_M  ((DSPI_FMEM_PMS0_ADDR_S_V)<<(DSPI_FMEM_PMS0_ADDR_S_S))
#define DSPI_FMEM_PMS0_ADDR_S_V  0x3FFFFFF
#define DSPI_FMEM_PMS0_ADDR_S_S  0

#define DSPI_FMEM_PMS1_ADDR_REG          (DR_REG_DSPI_MEM_BASE + 0x114)
/* DSPI_FMEM_PMS1_ADDR_S : R/W ;bitpos:[25:0] ;default: 26'hffffff ; */
/*description: SPI1 flash PMS section $n start address value.*/
#define DSPI_FMEM_PMS1_ADDR_S    0x03FFFFFF
#define DSPI_FMEM_PMS1_ADDR_S_M  ((DSPI_FMEM_PMS1_ADDR_S_V)<<(DSPI_FMEM_PMS1_ADDR_S_S))
#define DSPI_FMEM_PMS1_ADDR_S_V  0x3FFFFFF
#define DSPI_FMEM_PMS1_ADDR_S_S  0

#define DSPI_FMEM_PMS2_ADDR_REG          (DR_REG_DSPI_MEM_BASE + 0x118)
/* DSPI_FMEM_PMS2_ADDR_S : R/W ;bitpos:[25:0] ;default: 26'h1ffffff ; */
/*description: SPI1 flash PMS section $n start address value.*/
#define DSPI_FMEM_PMS2_ADDR_S    0x03FFFFFF
#define DSPI_FMEM_PMS2_ADDR_S_M  ((DSPI_FMEM_PMS2_ADDR_S_V)<<(DSPI_FMEM_PMS2_ADDR_S_S))
#define DSPI_FMEM_PMS2_ADDR_S_V  0x3FFFFFF
#define DSPI_FMEM_PMS2_ADDR_S_S  0

#define DSPI_FMEM_PMS3_ADDR_REG          (DR_REG_DSPI_MEM_BASE + 0x11C)
/* DSPI_FMEM_PMS3_ADDR_S : R/W ;bitpos:[25:0] ;default: 26'h2ffffff ; */
/*description: SPI1 flash PMS section $n start address value.*/
#define DSPI_FMEM_PMS3_ADDR_S    0x03FFFFFF
#define DSPI_FMEM_PMS3_ADDR_S_M  ((DSPI_FMEM_PMS3_ADDR_S_V)<<(DSPI_FMEM_PMS3_ADDR_S_S))
#define DSPI_FMEM_PMS3_ADDR_S_V  0x3FFFFFF
#define DSPI_FMEM_PMS3_ADDR_S_S  0

#define DSPI_FMEM_PMS0_SIZE_REG          (DR_REG_DSPI_MEM_BASE + 0x120)
/* DSPI_FMEM_PMS0_SIZE : R/W ;bitpos:[13:0] ;default: 14'h1000 ; */
/*description: SPI1 flash PMS section $n address region is (SPI_FMEM_PMS$n_ADDR_S, SPI_FMEM_PMS
$n_ADDR_S + SPI_FMEM_PMS$n_SIZE).*/
#define DSPI_FMEM_PMS0_SIZE    0x00003FFF
#define DSPI_FMEM_PMS0_SIZE_M  ((DSPI_FMEM_PMS0_SIZE_V)<<(DSPI_FMEM_PMS0_SIZE_S))
#define DSPI_FMEM_PMS0_SIZE_V  0x3FFF
#define DSPI_FMEM_PMS0_SIZE_S  0

#define DSPI_FMEM_PMS1_SIZE_REG          (DR_REG_DSPI_MEM_BASE + 0x124)
/* DSPI_FMEM_PMS1_SIZE : R/W ;bitpos:[13:0] ;default: 14'h1000 ; */
/*description: SPI1 flash PMS section $n address region is (SPI_FMEM_PMS$n_ADDR_S, SPI_FMEM_PMS
$n_ADDR_S + SPI_FMEM_PMS$n_SIZE).*/
#define DSPI_FMEM_PMS1_SIZE    0x00003FFF
#define DSPI_FMEM_PMS1_SIZE_M  ((DSPI_FMEM_PMS1_SIZE_V)<<(DSPI_FMEM_PMS1_SIZE_S))
#define DSPI_FMEM_PMS1_SIZE_V  0x3FFF
#define DSPI_FMEM_PMS1_SIZE_S  0

#define DSPI_FMEM_PMS2_SIZE_REG          (DR_REG_DSPI_MEM_BASE + 0x128)
/* DSPI_FMEM_PMS2_SIZE : R/W ;bitpos:[13:0] ;default: 14'h1000 ; */
/*description: SPI1 flash PMS section $n address region is (SPI_FMEM_PMS$n_ADDR_S, SPI_FMEM_PMS
$n_ADDR_S + SPI_FMEM_PMS$n_SIZE).*/
#define DSPI_FMEM_PMS2_SIZE    0x00003FFF
#define DSPI_FMEM_PMS2_SIZE_M  ((DSPI_FMEM_PMS2_SIZE_V)<<(DSPI_FMEM_PMS2_SIZE_S))
#define DSPI_FMEM_PMS2_SIZE_V  0x3FFF
#define DSPI_FMEM_PMS2_SIZE_S  0

