espressif/esp-idf/components/soc/esp32p4/include/soc/dspi_mem_reg.h
#define DSPI_FMEM_PMS3_SIZE_REG          (DR_REG_DSPI_MEM_BASE + 0x12C)
/* DSPI_FMEM_PMS3_SIZE : R/W ;bitpos:[13:0] ;default: 14'h1000 ; */
/*description: SPI1 flash PMS section $n address region is (SPI_FMEM_PMS$n_ADDR_S, SPI_FMEM_PMS
$n_ADDR_S + SPI_FMEM_PMS$n_SIZE).*/
#define DSPI_FMEM_PMS3_SIZE    0x00003FFF
#define DSPI_FMEM_PMS3_SIZE_M  ((DSPI_FMEM_PMS3_SIZE_V)<<(DSPI_FMEM_PMS3_SIZE_S))
#define DSPI_FMEM_PMS3_SIZE_V  0x3FFF
#define DSPI_FMEM_PMS3_SIZE_S  0

#define DSPI_SMEM_PMS0_ATTR_REG          (DR_REG_DSPI_MEM_BASE + 0x130)
/* DSPI_SMEM_PMS0_ECC : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: SPI1 external RAM PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. Th
e external RAM PMS section $n is configured by registers SPI_SMEM_PMS$n_ADDR_REG
 and SPI_SMEM_PMS$n_SIZE_REG..*/
#define DSPI_SMEM_PMS0_ECC    (BIT(2))
#define DSPI_SMEM_PMS0_ECC_M  (BIT(2))
#define DSPI_SMEM_PMS0_ECC_V  0x1
#define DSPI_SMEM_PMS0_ECC_S  2
/* DSPI_SMEM_PMS0_WR_ATTR : R/W ;bitpos:[1] ;default: 1'h1 ; */
/*description: 1: SPI1 external RAM PMS section $n write accessible. 0: Not allowed..*/
#define DSPI_SMEM_PMS0_WR_ATTR    (BIT(1))
#define DSPI_SMEM_PMS0_WR_ATTR_M  (BIT(1))
#define DSPI_SMEM_PMS0_WR_ATTR_V  0x1
#define DSPI_SMEM_PMS0_WR_ATTR_S  1
/* DSPI_SMEM_PMS0_RD_ATTR : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: 1: SPI1 external RAM PMS section $n read accessible. 0: Not allowed..*/
#define DSPI_SMEM_PMS0_RD_ATTR    (BIT(0))
#define DSPI_SMEM_PMS0_RD_ATTR_M  (BIT(0))
#define DSPI_SMEM_PMS0_RD_ATTR_V  0x1
#define DSPI_SMEM_PMS0_RD_ATTR_S  0

#define DSPI_SMEM_PMS1_ATTR_REG          (DR_REG_DSPI_MEM_BASE + 0x134)
/* DSPI_SMEM_PMS1_ECC : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: SPI1 external RAM PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. Th
e external RAM PMS section $n is configured by registers SPI_SMEM_PMS$n_ADDR_REG
 and SPI_SMEM_PMS$n_SIZE_REG..*/
#define DSPI_SMEM_PMS1_ECC    (BIT(2))
#define DSPI_SMEM_PMS1_ECC_M  (BIT(2))
#define DSPI_SMEM_PMS1_ECC_V  0x1
#define DSPI_SMEM_PMS1_ECC_S  2
/* DSPI_SMEM_PMS1_WR_ATTR : R/W ;bitpos:[1] ;default: 1'h1 ; */
/*description: 1: SPI1 external RAM PMS section $n write accessible. 0: Not allowed..*/
#define DSPI_SMEM_PMS1_WR_ATTR    (BIT(1))
#define DSPI_SMEM_PMS1_WR_ATTR_M  (BIT(1))
#define DSPI_SMEM_PMS1_WR_ATTR_V  0x1
#define DSPI_SMEM_PMS1_WR_ATTR_S  1
/* DSPI_SMEM_PMS1_RD_ATTR : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: 1: SPI1 external RAM PMS section $n read accessible. 0: Not allowed..*/
#define DSPI_SMEM_PMS1_RD_ATTR    (BIT(0))
#define DSPI_SMEM_PMS1_RD_ATTR_M  (BIT(0))
#define DSPI_SMEM_PMS1_RD_ATTR_V  0x1
#define DSPI_SMEM_PMS1_RD_ATTR_S  0

#define DSPI_SMEM_PMS2_ATTR_REG          (DR_REG_DSPI_MEM_BASE + 0x138)
/* DSPI_SMEM_PMS2_ECC : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: SPI1 external RAM PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. Th
e external RAM PMS section $n is configured by registers SPI_SMEM_PMS$n_ADDR_REG
 and SPI_SMEM_PMS$n_SIZE_REG..*/
#define DSPI_SMEM_PMS2_ECC    (BIT(2))
#define DSPI_SMEM_PMS2_ECC_M  (BIT(2))
#define DSPI_SMEM_PMS2_ECC_V  0x1
#define DSPI_SMEM_PMS2_ECC_S  2
/* DSPI_SMEM_PMS2_WR_ATTR : R/W ;bitpos:[1] ;default: 1'h1 ; */
/*description: 1: SPI1 external RAM PMS section $n write accessible. 0: Not allowed..*/
#define DSPI_SMEM_PMS2_WR_ATTR    (BIT(1))
#define DSPI_SMEM_PMS2_WR_ATTR_M  (BIT(1))
#define DSPI_SMEM_PMS2_WR_ATTR_V  0x1
#define DSPI_SMEM_PMS2_WR_ATTR_S  1
/* DSPI_SMEM_PMS2_RD_ATTR : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: 1: SPI1 external RAM PMS section $n read accessible. 0: Not allowed..*/
#define DSPI_SMEM_PMS2_RD_ATTR    (BIT(0))
#define DSPI_SMEM_PMS2_RD_ATTR_M  (BIT(0))
#define DSPI_SMEM_PMS2_RD_ATTR_V  0x1
#define DSPI_SMEM_PMS2_RD_ATTR_S  0

#define DSPI_SMEM_PMS3_ATTR_REG          (DR_REG_DSPI_MEM_BASE + 0x13C)
/* DSPI_SMEM_PMS3_ECC : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: SPI1 external RAM PMS section $n ECC mode, 1: enable ECC mode. 0: Disable it. Th
e external RAM PMS section $n is configured by registers SPI_SMEM_PMS$n_ADDR_REG
 and SPI_SMEM_PMS$n_SIZE_REG..*/
#define DSPI_SMEM_PMS3_ECC    (BIT(2))
#define DSPI_SMEM_PMS3_ECC_M  (BIT(2))
#define DSPI_SMEM_PMS3_ECC_V  0x1
#define DSPI_SMEM_PMS3_ECC_S  2
/* DSPI_SMEM_PMS3_WR_ATTR : R/W ;bitpos:[1] ;default: 1'h1 ; */
/*description: 1: SPI1 external RAM PMS section $n write accessible. 0: Not allowed..*/
#define DSPI_SMEM_PMS3_WR_ATTR    (BIT(1))
#define DSPI_SMEM_PMS3_WR_ATTR_M  (BIT(1))
#define DSPI_SMEM_PMS3_WR_ATTR_V  0x1
#define DSPI_SMEM_PMS3_WR_ATTR_S  1
/* DSPI_SMEM_PMS3_RD_ATTR : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: 1: SPI1 external RAM PMS section $n read accessible. 0: Not allowed..*/
#define DSPI_SMEM_PMS3_RD_ATTR    (BIT(0))
#define DSPI_SMEM_PMS3_RD_ATTR_M  (BIT(0))
#define DSPI_SMEM_PMS3_RD_ATTR_V  0x1
#define DSPI_SMEM_PMS3_RD_ATTR_S  0

#define DSPI_SMEM_PMS0_ADDR_REG          (DR_REG_DSPI_MEM_BASE + 0x140)
/* DSPI_SMEM_PMS0_ADDR_S : R/W ;bitpos:[25:0] ;default: 26'h0 ; */
/*description: SPI1 external RAM PMS section $n start address value.*/
#define DSPI_SMEM_PMS0_ADDR_S    0x03FFFFFF
#define DSPI_SMEM_PMS0_ADDR_S_M  ((DSPI_SMEM_PMS0_ADDR_S_V)<<(DSPI_SMEM_PMS0_ADDR_S_S))
#define DSPI_SMEM_PMS0_ADDR_S_V  0x3FFFFFF
#define DSPI_SMEM_PMS0_ADDR_S_S  0

#define DSPI_SMEM_PMS1_ADDR_REG          (DR_REG_DSPI_MEM_BASE + 0x144)
/* DSPI_SMEM_PMS1_ADDR_S : R/W ;bitpos:[25:0] ;default: 26'hffffff ; */
/*description: SPI1 external RAM PMS section $n start address value.*/
#define DSPI_SMEM_PMS1_ADDR_S    0x03FFFFFF
#define DSPI_SMEM_PMS1_ADDR_S_M  ((DSPI_SMEM_PMS1_ADDR_S_V)<<(DSPI_SMEM_PMS1_ADDR_S_S))
#define DSPI_SMEM_PMS1_ADDR_S_V  0x3FFFFFF
#define DSPI_SMEM_PMS1_ADDR_S_S  0

#define DSPI_SMEM_PMS2_ADDR_REG          (DR_REG_DSPI_MEM_BASE + 0x148)
/* DSPI_SMEM_PMS2_ADDR_S : R/W ;bitpos:[25:0] ;default: 26'h1ffffff ; */
/*description: SPI1 external RAM PMS section $n start address value.*/
#define DSPI_SMEM_PMS2_ADDR_S    0x03FFFFFF
#define DSPI_SMEM_PMS2_ADDR_S_M  ((DSPI_SMEM_PMS2_ADDR_S_V)<<(DSPI_SMEM_PMS2_ADDR_S_S))
#define DSPI_SMEM_PMS2_ADDR_S_V  0x3FFFFFF
#define DSPI_SMEM_PMS2_ADDR_S_S  0

#define DSPI_SMEM_PMS3_ADDR_REG          (DR_REG_DSPI_MEM_BASE + 0x14C)
/* DSPI_SMEM_PMS3_ADDR_S : R/W ;bitpos:[25:0] ;default: 26'h2ffffff ; */
/*description: SPI1 external RAM PMS section $n start address value.*/
#define DSPI_SMEM_PMS3_ADDR_S    0x03FFFFFF
#define DSPI_SMEM_PMS3_ADDR_S_M  ((DSPI_SMEM_PMS3_ADDR_S_V)<<(DSPI_SMEM_PMS3_ADDR_S_S))
#define DSPI_SMEM_PMS3_ADDR_S_V  0x3FFFFFF
#define DSPI_SMEM_PMS3_ADDR_S_S  0

#define DSPI_SMEM_PMS0_SIZE_REG          (DR_REG_DSPI_MEM_BASE + 0x150)
/* DSPI_SMEM_PMS0_SIZE : R/W ;bitpos:[13:0] ;default: 14'h1000 ; */
/*description: SPI1 external RAM PMS section $n address region is (SPI_SMEM_PMS$n_ADDR_S, SPI_S
MEM_PMS$n_ADDR_S + SPI_SMEM_PMS$n_SIZE).*/
#define DSPI_SMEM_PMS0_SIZE    0x00003FFF
#define DSPI_SMEM_PMS0_SIZE_M  ((DSPI_SMEM_PMS0_SIZE_V)<<(DSPI_SMEM_PMS0_SIZE_S))
#define DSPI_SMEM_PMS0_SIZE_V  0x3FFF
#define DSPI_SMEM_PMS0_SIZE_S  0

#define DSPI_SMEM_PMS1_SIZE_REG          (DR_REG_DSPI_MEM_BASE + 0x154)
/* DSPI_SMEM_PMS1_SIZE : R/W ;bitpos:[13:0] ;default: 14'h1000 ; */
/*description: SPI1 external RAM PMS section $n address region is (SPI_SMEM_PMS$n_ADDR_S, SPI_S
MEM_PMS$n_ADDR_S + SPI_SMEM_PMS$n_SIZE).*/
#define DSPI_SMEM_PMS1_SIZE    0x00003FFF
#define DSPI_SMEM_PMS1_SIZE_M  ((DSPI_SMEM_PMS1_SIZE_V)<<(DSPI_SMEM_PMS1_SIZE_S))
#define DSPI_SMEM_PMS1_SIZE_V  0x3FFF
#define DSPI_SMEM_PMS1_SIZE_S  0

#define DSPI_SMEM_PMS2_SIZE_REG          (DR_REG_DSPI_MEM_BASE + 0x158)
/* DSPI_SMEM_PMS2_SIZE : R/W ;bitpos:[13:0] ;default: 14'h1000 ; */
/*description: SPI1 external RAM PMS section $n address region is (SPI_SMEM_PMS$n_ADDR_S, SPI_S
MEM_PMS$n_ADDR_S + SPI_SMEM_PMS$n_SIZE).*/
#define DSPI_SMEM_PMS2_SIZE    0x00003FFF
#define DSPI_SMEM_PMS2_SIZE_M  ((DSPI_SMEM_PMS2_SIZE_V)<<(DSPI_SMEM_PMS2_SIZE_S))
#define DSPI_SMEM_PMS2_SIZE_V  0x3FFF
#define DSPI_SMEM_PMS2_SIZE_S  0

#define DSPI_SMEM_PMS3_SIZE_REG          (DR_REG_DSPI_MEM_BASE + 0x15C)
/* DSPI_SMEM_PMS3_SIZE : R/W ;bitpos:[13:0] ;default: 14'h1000 ; */
/*description: SPI1 external RAM PMS section $n address region is (SPI_SMEM_PMS$n_ADDR_S, SPI_S
MEM_PMS$n_ADDR_S + SPI_SMEM_PMS$n_SIZE).*/
#define DSPI_SMEM_PMS3_SIZE    0x00003FFF
#define DSPI_SMEM_PMS3_SIZE_M  ((DSPI_SMEM_PMS3_SIZE_V)<<(DSPI_SMEM_PMS3_SIZE_S))
#define DSPI_SMEM_PMS3_SIZE_V  0x3FFF
#define DSPI_SMEM_PMS3_SIZE_S  0

#define DSPI_MEM_PMS_REJECT_REG          (DR_REG_DSPI_MEM_BASE + 0x164)
/* DSPI_MEM_PMS_IVD : R/SS/WTC ;bitpos:[31] ;default: 1'h0 ; */
/*description: 1: SPI1 access is rejected because of address multi-hit. 0: No address multi-hit
 error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set..*/
#define DSPI_MEM_PMS_IVD    (BIT(31))
#define DSPI_MEM_PMS_IVD_M  (BIT(31))
#define DSPI_MEM_PMS_IVD_V  0x1
#define DSPI_MEM_PMS_IVD_S  31
/* DSPI_MEM_PMS_MULTI_HIT : R/SS/WTC ;bitpos:[30] ;default: 1'b0 ; */
/*description: 1: SPI1 access is rejected because of address miss. 0: No address miss error. It
 is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set..*/
#define DSPI_MEM_PMS_MULTI_HIT    (BIT(30))
#define DSPI_MEM_PMS_MULTI_HIT_M  (BIT(30))
#define DSPI_MEM_PMS_MULTI_HIT_V  0x1
#define DSPI_MEM_PMS_MULTI_HIT_S  30
/* DSPI_MEM_PMS_ST : R/SS/WTC ;bitpos:[29] ;default: 1'b0 ; */
/*description: 1: SPI1 read access error. 0: No read access error. It is cleared by when  SPI_M
EM_PMS_REJECT_INT_CLR bit is set..*/
#define DSPI_MEM_PMS_ST    (BIT(29))
#define DSPI_MEM_PMS_ST_M  (BIT(29))
#define DSPI_MEM_PMS_ST_V  0x1
#define DSPI_MEM_PMS_ST_S  29
/* DSPI_MEM_PMS_LD : R/SS/WTC ;bitpos:[28] ;default: 1'b0 ; */
/*description: 1: SPI1 write access error. 0: No write access error. It is cleared by when  SPI
_MEM_PMS_REJECT_INT_CLR bit is set..*/
#define DSPI_MEM_PMS_LD    (BIT(28))
#define DSPI_MEM_PMS_LD_M  (BIT(28))
#define DSPI_MEM_PMS_LD_V  0x1
#define DSPI_MEM_PMS_LD_S  28
/* DSPI_MEM_PM_EN : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: Set this bit to enable SPI0/1 transfer permission control function..*/
#define DSPI_MEM_PM_EN    (BIT(26))
#define DSPI_MEM_PM_EN_M  (BIT(26))
#define DSPI_MEM_PM_EN_V  0x1
#define DSPI_MEM_PM_EN_S  26
/* DSPI_MEM_REJECT_ADDR : R/SS/WTC ;bitpos:[25:0] ;default: 26'h0 ; */
/*description: This bits show the first SPI1 access error address. It is cleared by when  SPI_M
EM_PMS_REJECT_INT_CLR bit is set..*/
#define DSPI_MEM_REJECT_ADDR    0x03FFFFFF
#define DSPI_MEM_REJECT_ADDR_M  ((DSPI_MEM_REJECT_ADDR_V)<<(DSPI_MEM_REJECT_ADDR_S))
#define DSPI_MEM_REJECT_ADDR_V  0x3FFFFFF
#define DSPI_MEM_REJECT_ADDR_S  0

#define DSPI_MEM_ECC_CTRL_REG          (DR_REG_DSPI_MEM_BASE + 0x168)
/* DSPI_MEM_ECC_ERR_BITS : R/SS/WTC ;bitpos:[31:25] ;default: 7'd0 ; */
/*description: Records the first ECC error bit number in the 16 bytes(From 0~127, corresponding
 to byte 0 bit 0 to byte 15 bit 7).*/
#define DSPI_MEM_ECC_ERR_BITS    0x0000007F
#define DSPI_MEM_ECC_ERR_BITS_M  ((DSPI_MEM_ECC_ERR_BITS_V)<<(DSPI_MEM_ECC_ERR_BITS_S))
#define DSPI_MEM_ECC_ERR_BITS_V  0x7F
#define DSPI_MEM_ECC_ERR_BITS_S  25
/* DSPI_MEM_ECC_CONTINUE_RECORD_ERR_EN : R/W ;bitpos:[24] ;default: 1'b1 ; */
/*description: 1: The error information in SPI_MEM_ECC_ERR_BITS and SPI_MEM_ECC_ERR_ADDR is upd
ated when there is an ECC error. 0: SPI_MEM_ECC_ERR_BITS and SPI_MEM_ECC_ERR_ADD
R record the first ECC error information..*/
#define DSPI_MEM_ECC_CONTINUE_RECORD_ERR_EN    (BIT(24))
#define DSPI_MEM_ECC_CONTINUE_RECORD_ERR_EN_M  (BIT(24))
#define DSPI_MEM_ECC_CONTINUE_RECORD_ERR_EN_V  0x1
#define DSPI_MEM_ECC_CONTINUE_RECORD_ERR_EN_S  24
/* DSPI_MEM_USR_ECC_ADDR_EN : R/W ;bitpos:[21] ;default: 1'd0 ; */
/*description: Set this bit to enable ECC address convert in SPI0/1 USR_CMD transfer..*/
#define DSPI_MEM_USR_ECC_ADDR_EN    (BIT(21))
#define DSPI_MEM_USR_ECC_ADDR_EN_M  (BIT(21))
#define DSPI_MEM_USR_ECC_ADDR_EN_V  0x1
#define DSPI_MEM_USR_ECC_ADDR_EN_S  21
/* DSPI_FMEM_ECC_ADDR_EN : R/W ;bitpos:[20] ;default: 1'd0 ; */
/*description: Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to t
he ECC region or non-ECC region of flash. If there is no ECC region in flash, th
is bit should be 0. Otherwise, this bit should be 1..*/
#define DSPI_FMEM_ECC_ADDR_EN    (BIT(20))
#define DSPI_FMEM_ECC_ADDR_EN_M  (BIT(20))
#define DSPI_FMEM_ECC_ADDR_EN_V  0x1
#define DSPI_FMEM_ECC_ADDR_EN_S  20
/* DSPI_FMEM_PAGE_SIZE : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: Set the page size of the flash accessed by MSPI. 0: 256 bytes. 1: 512 bytes. 2:
1024 bytes. 3: 2048 bytes..*/
#define DSPI_FMEM_PAGE_SIZE    0x00000003
#define DSPI_FMEM_PAGE_SIZE_M  ((DSPI_FMEM_PAGE_SIZE_V)<<(DSPI_FMEM_PAGE_SIZE_S))
#define DSPI_FMEM_PAGE_SIZE_V  0x3
#define DSPI_FMEM_PAGE_SIZE_S  18
/* DSPI_FMEM_ECC_ERR_INT_EN : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: Set this bit to calculate the error times of MSPI ECC read when accesses to flas
h..*/
#define DSPI_FMEM_ECC_ERR_INT_EN    (BIT(17))
#define DSPI_FMEM_ECC_ERR_INT_EN_M  (BIT(17))
#define DSPI_FMEM_ECC_ERR_INT_EN_V  0x1
#define DSPI_FMEM_ECC_ERR_INT_EN_S  17
/* DSPI_FMEM_ECC_ERR_INT_NUM : R/W ;bitpos:[16:11] ;default: 6'd10 ; */
/*description: Set the error times of MSPI ECC read to generate MSPI SPI_MEM_ECC_ERR_INT interr
upt..*/
#define DSPI_FMEM_ECC_ERR_INT_NUM    0x0000003F
#define DSPI_FMEM_ECC_ERR_INT_NUM_M  ((DSPI_FMEM_ECC_ERR_INT_NUM_V)<<(DSPI_FMEM_ECC_ERR_INT_NUM_S))
#define DSPI_FMEM_ECC_ERR_INT_NUM_V  0x3F
#define DSPI_FMEM_ECC_ERR_INT_NUM_S  11

#define DSPI_MEM_ECC_ERR_ADDR_REG          (DR_REG_DSPI_MEM_BASE + 0x16C)
/* DSPI_MEM_ECC_ERR_CNT : R/SS/WTC ;bitpos:[31:26] ;default: 6'd0 ; */
/*description: This bits show the error times of MSPI ECC read. It is cleared by when  SPI_MEM_
ECC_ERR_INT_CLR bit is set..*/
#define DSPI_MEM_ECC_ERR_CNT    0x0000003F
#define DSPI_MEM_ECC_ERR_CNT_M  ((DSPI_MEM_ECC_ERR_CNT_V)<<(DSPI_MEM_ECC_ERR_CNT_S))
#define DSPI_MEM_ECC_ERR_CNT_V  0x3F
#define DSPI_MEM_ECC_ERR_CNT_S  26
/* DSPI_MEM_ECC_ERR_ADDR : R/SS/WTC ;bitpos:[25:0] ;default: 26'h0 ; */
/*description: This bits show the first MSPI ECC error address. It is cleared by when  SPI_MEM_
ECC_ERR_INT_CLR bit is set..*/
#define DSPI_MEM_ECC_ERR_ADDR    0x03FFFFFF
#define DSPI_MEM_ECC_ERR_ADDR_M  ((DSPI_MEM_ECC_ERR_ADDR_V)<<(DSPI_MEM_ECC_ERR_ADDR_S))
#define DSPI_MEM_ECC_ERR_ADDR_V  0x3FFFFFF
#define DSPI_MEM_ECC_ERR_ADDR_S  0

#define DSPI_MEM_AXI_ERR_ADDR_REG          (DR_REG_DSPI_MEM_BASE + 0x170)
/* DSPI_MEM_SPI_ALL_AXI_TRANS_AFIFO_EMPTY : RO ;bitpos:[31] ;default: 1'b1 ; */
/*description: This bit is set when WADDR_AFIFO, WBLEN_AFIFO, WDATA_AFIFO, AXI_RADDR_CTL_AFIFO
and RDATA_AFIFO are empty and spi0_mst_st is IDLE..*/
#define DSPI_MEM_SPI_ALL_AXI_TRANS_AFIFO_EMPTY    (BIT(31))
#define DSPI_MEM_SPI_ALL_AXI_TRANS_AFIFO_EMPTY_M  (BIT(31))
#define DSPI_MEM_SPI_ALL_AXI_TRANS_AFIFO_EMPTY_V  0x1
#define DSPI_MEM_SPI_ALL_AXI_TRANS_AFIFO_EMPTY_S  31
/* DSPI_MEM_SPI_WBLEN_AFIFO_REMPTY : RO ;bitpos:[30] ;default: 1'b1 ; */
/*description: 1: WBLEN_AFIFO is empty. 0: At least one AXI write transfer is pending..*/
#define DSPI_MEM_SPI_WBLEN_AFIFO_REMPTY    (BIT(30))
#define DSPI_MEM_SPI_WBLEN_AFIFO_REMPTY_M  (BIT(30))
#define DSPI_MEM_SPI_WBLEN_AFIFO_REMPTY_V  0x1
#define DSPI_MEM_SPI_WBLEN_AFIFO_REMPTY_S  30
/* DSPI_MEM_SPI_WDATA_AFIFO_REMPTY : RO ;bitpos:[29] ;default: 1'b1 ; */
/*description: 1: WDATA_AFIFO is empty. 0: At least one AXI write transfer is pending..*/
#define DSPI_MEM_SPI_WDATA_AFIFO_REMPTY    (BIT(29))
#define DSPI_MEM_SPI_WDATA_AFIFO_REMPTY_M  (BIT(29))
#define DSPI_MEM_SPI_WDATA_AFIFO_REMPTY_V  0x1
#define DSPI_MEM_SPI_WDATA_AFIFO_REMPTY_S  29
/* DSPI_MEM_SPI_RADDR_AFIFO_REMPTY : RO ;bitpos:[28] ;default: 1'b1 ; */
/*description: 1: AXI_RADDR_CTL_AFIFO is empty. 0: At least one AXI read transfer is pending..*/
#define DSPI_MEM_SPI_RADDR_AFIFO_REMPTY    (BIT(28))
#define DSPI_MEM_SPI_RADDR_AFIFO_REMPTY_M  (BIT(28))
#define DSPI_MEM_SPI_RADDR_AFIFO_REMPTY_V  0x1
#define DSPI_MEM_SPI_RADDR_AFIFO_REMPTY_S  28
/* DSPI_MEM_SPI_RDATA_AFIFO_REMPTY : RO ;bitpos:[27] ;default: 1'b1 ; */
/*description: 1: RDATA_AFIFO is empty. 0: At least one AXI read transfer is pending..*/
#define DSPI_MEM_SPI_RDATA_AFIFO_REMPTY    (BIT(27))
#define DSPI_MEM_SPI_RDATA_AFIFO_REMPTY_M  (BIT(27))
#define DSPI_MEM_SPI_RDATA_AFIFO_REMPTY_V  0x1
#define DSPI_MEM_SPI_RDATA_AFIFO_REMPTY_S  27
/* DSPI_MEM_ALL_FIFO_EMPTY : RO ;bitpos:[26] ;default: 1'b1 ; */
/*description: The empty status of all AFIFO and SYNC_FIFO in MSPI module. 1: All AXI transfers
 and SPI0 transfers are done. 0: Others..*/
#define DSPI_MEM_ALL_FIFO_EMPTY    (BIT(26))
#define DSPI_MEM_ALL_FIFO_EMPTY_M  (BIT(26))
#define DSPI_MEM_ALL_FIFO_EMPTY_V  0x1
#define DSPI_MEM_ALL_FIFO_EMPTY_S  26
/* DSPI_MEM_AXI_ERR_ADDR : R/SS/WTC ;bitpos:[25:0] ;default: 26'h0 ; */
/*description: This bits show the first AXI write/read invalid error or AXI write flash error a
ddress. It is cleared by when SPI_MEM_AXI_WADDR_ERR_INT_CLR, SPI_MEM_AXI_WR_FLAS
H_ERR_IN_CLR or SPI_MEM_AXI_RADDR_ERR_IN_CLR bit is set..*/
#define DSPI_MEM_AXI_ERR_ADDR    0x03FFFFFF
#define DSPI_MEM_AXI_ERR_ADDR_M  ((DSPI_MEM_AXI_ERR_ADDR_V)<<(DSPI_MEM_AXI_ERR_ADDR_S))
#define DSPI_MEM_AXI_ERR_ADDR_V  0x3FFFFFF
#define DSPI_MEM_AXI_ERR_ADDR_S  0

#define DSPI_SMEM_ECC_CTRL_REG          (DR_REG_DSPI_MEM_BASE + 0x174)
/* DSPI_SMEM_ECC_ADDR_EN : R/W ;bitpos:[20] ;default: 1'd0 ; */
/*description: Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to t
he ECC region or non-ECC region of external RAM. If there is no ECC region in ex
ternal RAM, this bit should be 0. Otherwise, this bit should be 1..*/
#define DSPI_SMEM_ECC_ADDR_EN    (BIT(20))
#define DSPI_SMEM_ECC_ADDR_EN_M  (BIT(20))
#define DSPI_SMEM_ECC_ADDR_EN_V  0x1
#define DSPI_SMEM_ECC_ADDR_EN_S  20
/* DSPI_SMEM_PAGE_SIZE : R/W ;bitpos:[19:18] ;default: 2'd2 ; */
/*description: Set the page size of the external RAM accessed by MSPI. 0: 256 bytes. 1: 512 byt
es. 2: 1024 bytes. 3: 2048 bytes..*/
#define DSPI_SMEM_PAGE_SIZE    0x00000003
#define DSPI_SMEM_PAGE_SIZE_M  ((DSPI_SMEM_PAGE_SIZE_V)<<(DSPI_SMEM_PAGE_SIZE_S))
#define DSPI_SMEM_PAGE_SIZE_V  0x3
#define DSPI_SMEM_PAGE_SIZE_S  18
/* DSPI_SMEM_ECC_ERR_INT_EN : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: Set this bit to calculate the error times of MSPI ECC read when accesses to exte
rnal RAM..*/
#define DSPI_SMEM_ECC_ERR_INT_EN    (BIT(17))
#define DSPI_SMEM_ECC_ERR_INT_EN_M  (BIT(17))
#define DSPI_SMEM_ECC_ERR_INT_EN_V  0x1
#define DSPI_SMEM_ECC_ERR_INT_EN_S  17

#define DSPI_MEM_TIMING_CALI_REG          (DR_REG_DSPI_MEM_BASE + 0x180)
/* DSPI_MEM_TIMING_CALI_UPDATE : WT ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to update delay mode, delay num and extra dummy in MSPI..*/
#define DSPI_MEM_TIMING_CALI_UPDATE    (BIT(6))
#define DSPI_MEM_TIMING_CALI_UPDATE_M  (BIT(6))
#define DSPI_MEM_TIMING_CALI_UPDATE_V  0x1
#define DSPI_MEM_TIMING_CALI_UPDATE_S  6
/* DSPI_MEM_DLL_TIMING_CALI : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to enable DLL for timing calibration in DDR mode when accessed to f
lash..*/
#define DSPI_MEM_DLL_TIMING_CALI    (BIT(5))
#define DSPI_MEM_DLL_TIMING_CALI_M  (BIT(5))
#define DSPI_MEM_DLL_TIMING_CALI_V  0x1
#define DSPI_MEM_DLL_TIMING_CALI_S  5
/* DSPI_MEM_EXTRA_DUMMY_CYCLELEN : R/W ;bitpos:[4:2] ;default: 3'd0 ; */
/*description: add extra dummy spi clock cycle length for spi clock calibration..*/
#define DSPI_MEM_EXTRA_DUMMY_CYCLELEN    0x00000007
#define DSPI_MEM_EXTRA_DUMMY_CYCLELEN_M  ((DSPI_MEM_EXTRA_DUMMY_CYCLELEN_V)<<(DSPI_MEM_EXTRA_DUMMY_CYCLELEN_S))
#define DSPI_MEM_EXTRA_DUMMY_CYCLELEN_V  0x7
#define DSPI_MEM_EXTRA_DUMMY_CYCLELEN_S  2
/* DSPI_MEM_TIMING_CALI : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to enable timing auto-calibration for all reading operations..*/
#define DSPI_MEM_TIMING_CALI    (BIT(1))
#define DSPI_MEM_TIMING_CALI_M  (BIT(1))
#define DSPI_MEM_TIMING_CALI_V  0x1
#define DSPI_MEM_TIMING_CALI_S  1
/* DSPI_MEM_TIMING_CLK_ENA : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: The bit is used to enable timing adjust clock for all reading operations..*/
#define DSPI_MEM_TIMING_CLK_ENA    (BIT(0))
#define DSPI_MEM_TIMING_CLK_ENA_M  (BIT(0))
#define DSPI_MEM_TIMING_CLK_ENA_V  0x1
#define DSPI_MEM_TIMING_CLK_ENA_S  0

