espressif/esp-idf/components/soc/esp32p4/include/soc/dspi_mem_reg.h
#define DSPI_MEM_DIN_MODE_REG          (DR_REG_DSPI_MEM_BASE + 0x184)
/* DSPI_MEM_DINS_MODE : R/W ;bitpos:[26:24] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: inp
ut with the spi_clk.*/
#define DSPI_MEM_DINS_MODE    0x00000007
#define DSPI_MEM_DINS_MODE_M  ((DSPI_MEM_DINS_MODE_V)<<(DSPI_MEM_DINS_MODE_S))
#define DSPI_MEM_DINS_MODE_V  0x7
#define DSPI_MEM_DINS_MODE_S  24
/* DSPI_MEM_DIN7_MODE : R/W ;bitpos:[23:21] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: inp
ut with the spi_clk.*/
#define DSPI_MEM_DIN7_MODE    0x00000007
#define DSPI_MEM_DIN7_MODE_M  ((DSPI_MEM_DIN7_MODE_V)<<(DSPI_MEM_DIN7_MODE_S))
#define DSPI_MEM_DIN7_MODE_V  0x7
#define DSPI_MEM_DIN7_MODE_S  21
/* DSPI_MEM_DIN6_MODE : R/W ;bitpos:[20:18] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: inp
ut with the spi_clk.*/
#define DSPI_MEM_DIN6_MODE    0x00000007
#define DSPI_MEM_DIN6_MODE_M  ((DSPI_MEM_DIN6_MODE_V)<<(DSPI_MEM_DIN6_MODE_S))
#define DSPI_MEM_DIN6_MODE_V  0x7
#define DSPI_MEM_DIN6_MODE_S  18
/* DSPI_MEM_DIN5_MODE : R/W ;bitpos:[17:15] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: inp
ut with the spi_clk.*/
#define DSPI_MEM_DIN5_MODE    0x00000007
#define DSPI_MEM_DIN5_MODE_M  ((DSPI_MEM_DIN5_MODE_V)<<(DSPI_MEM_DIN5_MODE_S))
#define DSPI_MEM_DIN5_MODE_V  0x7
#define DSPI_MEM_DIN5_MODE_S  15
/* DSPI_MEM_DIN4_MODE : R/W ;bitpos:[14:12] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: inp
ut with the spi_clk.*/
#define DSPI_MEM_DIN4_MODE    0x00000007
#define DSPI_MEM_DIN4_MODE_M  ((DSPI_MEM_DIN4_MODE_V)<<(DSPI_MEM_DIN4_MODE_S))
#define DSPI_MEM_DIN4_MODE_V  0x7
#define DSPI_MEM_DIN4_MODE_S  12
/* DSPI_MEM_DIN3_MODE : R/W ;bitpos:[11:9] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_MEM_DIN3_MODE    0x00000007
#define DSPI_MEM_DIN3_MODE_M  ((DSPI_MEM_DIN3_MODE_V)<<(DSPI_MEM_DIN3_MODE_S))
#define DSPI_MEM_DIN3_MODE_V  0x7
#define DSPI_MEM_DIN3_MODE_S  9
/* DSPI_MEM_DIN2_MODE : R/W ;bitpos:[8:6] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_MEM_DIN2_MODE    0x00000007
#define DSPI_MEM_DIN2_MODE_M  ((DSPI_MEM_DIN2_MODE_V)<<(DSPI_MEM_DIN2_MODE_S))
#define DSPI_MEM_DIN2_MODE_V  0x7
#define DSPI_MEM_DIN2_MODE_S  6
/* DSPI_MEM_DIN1_MODE : R/W ;bitpos:[5:3] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_MEM_DIN1_MODE    0x00000007
#define DSPI_MEM_DIN1_MODE_M  ((DSPI_MEM_DIN1_MODE_V)<<(DSPI_MEM_DIN1_MODE_S))
#define DSPI_MEM_DIN1_MODE_V  0x7
#define DSPI_MEM_DIN1_MODE_S  3
/* DSPI_MEM_DIN0_MODE : R/W ;bitpos:[2:0] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_MEM_DIN0_MODE    0x00000007
#define DSPI_MEM_DIN0_MODE_M  ((DSPI_MEM_DIN0_MODE_V)<<(DSPI_MEM_DIN0_MODE_S))
#define DSPI_MEM_DIN0_MODE_V  0x7
#define DSPI_MEM_DIN0_MODE_S  0

#define DSPI_MEM_DIN_NUM_REG          (DR_REG_DSPI_MEM_BASE + 0x188)
/* DSPI_MEM_DINS_NUM : R/W ;bitpos:[17:16] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_MEM_DINS_NUM    0x00000003
#define DSPI_MEM_DINS_NUM_M  ((DSPI_MEM_DINS_NUM_V)<<(DSPI_MEM_DINS_NUM_S))
#define DSPI_MEM_DINS_NUM_V  0x3
#define DSPI_MEM_DINS_NUM_S  16
/* DSPI_MEM_DIN7_NUM : R/W ;bitpos:[15:14] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_MEM_DIN7_NUM    0x00000003
#define DSPI_MEM_DIN7_NUM_M  ((DSPI_MEM_DIN7_NUM_V)<<(DSPI_MEM_DIN7_NUM_S))
#define DSPI_MEM_DIN7_NUM_V  0x3
#define DSPI_MEM_DIN7_NUM_S  14
/* DSPI_MEM_DIN6_NUM : R/W ;bitpos:[13:12] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_MEM_DIN6_NUM    0x00000003
#define DSPI_MEM_DIN6_NUM_M  ((DSPI_MEM_DIN6_NUM_V)<<(DSPI_MEM_DIN6_NUM_S))
#define DSPI_MEM_DIN6_NUM_V  0x3
#define DSPI_MEM_DIN6_NUM_S  12
/* DSPI_MEM_DIN5_NUM : R/W ;bitpos:[11:10] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_MEM_DIN5_NUM    0x00000003
#define DSPI_MEM_DIN5_NUM_M  ((DSPI_MEM_DIN5_NUM_V)<<(DSPI_MEM_DIN5_NUM_S))
#define DSPI_MEM_DIN5_NUM_V  0x3
#define DSPI_MEM_DIN5_NUM_S  10
/* DSPI_MEM_DIN4_NUM : R/W ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_MEM_DIN4_NUM    0x00000003
#define DSPI_MEM_DIN4_NUM_M  ((DSPI_MEM_DIN4_NUM_V)<<(DSPI_MEM_DIN4_NUM_S))
#define DSPI_MEM_DIN4_NUM_V  0x3
#define DSPI_MEM_DIN4_NUM_S  8
/* DSPI_MEM_DIN3_NUM : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_MEM_DIN3_NUM    0x00000003
#define DSPI_MEM_DIN3_NUM_M  ((DSPI_MEM_DIN3_NUM_V)<<(DSPI_MEM_DIN3_NUM_S))
#define DSPI_MEM_DIN3_NUM_V  0x3
#define DSPI_MEM_DIN3_NUM_S  6
/* DSPI_MEM_DIN2_NUM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_MEM_DIN2_NUM    0x00000003
#define DSPI_MEM_DIN2_NUM_M  ((DSPI_MEM_DIN2_NUM_V)<<(DSPI_MEM_DIN2_NUM_S))
#define DSPI_MEM_DIN2_NUM_V  0x3
#define DSPI_MEM_DIN2_NUM_S  4
/* DSPI_MEM_DIN1_NUM : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_MEM_DIN1_NUM    0x00000003
#define DSPI_MEM_DIN1_NUM_M  ((DSPI_MEM_DIN1_NUM_V)<<(DSPI_MEM_DIN1_NUM_S))
#define DSPI_MEM_DIN1_NUM_V  0x3
#define DSPI_MEM_DIN1_NUM_S  2
/* DSPI_MEM_DIN0_NUM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_MEM_DIN0_NUM    0x00000003
#define DSPI_MEM_DIN0_NUM_M  ((DSPI_MEM_DIN0_NUM_V)<<(DSPI_MEM_DIN0_NUM_S))
#define DSPI_MEM_DIN0_NUM_V  0x3
#define DSPI_MEM_DIN0_NUM_S  0

#define DSPI_MEM_DOUT_MODE_REG          (DR_REG_DSPI_MEM_BASE + 0x18C)
/* DSPI_MEM_DOUTS_MODE : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the spi_clk.*/
#define DSPI_MEM_DOUTS_MODE    (BIT(8))
#define DSPI_MEM_DOUTS_MODE_M  (BIT(8))
#define DSPI_MEM_DOUTS_MODE_V  0x1
#define DSPI_MEM_DOUTS_MODE_S  8
/* DSPI_MEM_DOUT7_MODE : R/W ;bitpos:[7] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the spi_clk.*/
#define DSPI_MEM_DOUT7_MODE    (BIT(7))
#define DSPI_MEM_DOUT7_MODE_M  (BIT(7))
#define DSPI_MEM_DOUT7_MODE_V  0x1
#define DSPI_MEM_DOUT7_MODE_S  7
/* DSPI_MEM_DOUT6_MODE : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the spi_clk.*/
#define DSPI_MEM_DOUT6_MODE    (BIT(6))
#define DSPI_MEM_DOUT6_MODE_M  (BIT(6))
#define DSPI_MEM_DOUT6_MODE_V  0x1
#define DSPI_MEM_DOUT6_MODE_S  6
/* DSPI_MEM_DOUT5_MODE : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the spi_clk.*/
#define DSPI_MEM_DOUT5_MODE    (BIT(5))
#define DSPI_MEM_DOUT5_MODE_M  (BIT(5))
#define DSPI_MEM_DOUT5_MODE_V  0x1
#define DSPI_MEM_DOUT5_MODE_S  5
/* DSPI_MEM_DOUT4_MODE : R/W ;bitpos:[4] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the spi_clk.*/
#define DSPI_MEM_DOUT4_MODE    (BIT(4))
#define DSPI_MEM_DOUT4_MODE_M  (BIT(4))
#define DSPI_MEM_DOUT4_MODE_V  0x1
#define DSPI_MEM_DOUT4_MODE_S  4
/* DSPI_MEM_DOUT3_MODE : R/W ;bitpos:[3] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_MEM_DOUT3_MODE    (BIT(3))
#define DSPI_MEM_DOUT3_MODE_M  (BIT(3))
#define DSPI_MEM_DOUT3_MODE_V  0x1
#define DSPI_MEM_DOUT3_MODE_S  3
/* DSPI_MEM_DOUT2_MODE : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_MEM_DOUT2_MODE    (BIT(2))
#define DSPI_MEM_DOUT2_MODE_M  (BIT(2))
#define DSPI_MEM_DOUT2_MODE_V  0x1
#define DSPI_MEM_DOUT2_MODE_S  2
/* DSPI_MEM_DOUT1_MODE : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_MEM_DOUT1_MODE    (BIT(1))
#define DSPI_MEM_DOUT1_MODE_M  (BIT(1))
#define DSPI_MEM_DOUT1_MODE_V  0x1
#define DSPI_MEM_DOUT1_MODE_S  1
/* DSPI_MEM_DOUT0_MODE : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_MEM_DOUT0_MODE    (BIT(0))
#define DSPI_MEM_DOUT0_MODE_M  (BIT(0))
#define DSPI_MEM_DOUT0_MODE_V  0x1
#define DSPI_MEM_DOUT0_MODE_S  0

#define DSPI_SMEM_TIMING_CALI_REG          (DR_REG_DSPI_MEM_BASE + 0x190)
/* DSPI_SMEM_DLL_TIMING_CALI : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to enable DLL for timing calibration in DDR mode when accessed to E
XT_RAM..*/
#define DSPI_SMEM_DLL_TIMING_CALI    (BIT(5))
#define DSPI_SMEM_DLL_TIMING_CALI_M  (BIT(5))
#define DSPI_SMEM_DLL_TIMING_CALI_V  0x1
#define DSPI_SMEM_DLL_TIMING_CALI_S  5
/* DSPI_SMEM_EXTRA_DUMMY_CYCLELEN : R/W ;bitpos:[4:2] ;default: 3'd0 ; */
/*description: For sram, add extra dummy spi clock cycle length for spi clock calibration..*/
#define DSPI_SMEM_EXTRA_DUMMY_CYCLELEN    0x00000007
#define DSPI_SMEM_EXTRA_DUMMY_CYCLELEN_M  ((DSPI_SMEM_EXTRA_DUMMY_CYCLELEN_V)<<(DSPI_SMEM_EXTRA_DUMMY_CYCLELEN_S))
#define DSPI_SMEM_EXTRA_DUMMY_CYCLELEN_V  0x7
#define DSPI_SMEM_EXTRA_DUMMY_CYCLELEN_S  2
/* DSPI_SMEM_TIMING_CALI : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: For sram, the bit is used to enable timing auto-calibration for all reading oper
ations..*/
#define DSPI_SMEM_TIMING_CALI    (BIT(1))
#define DSPI_SMEM_TIMING_CALI_M  (BIT(1))
#define DSPI_SMEM_TIMING_CALI_V  0x1
#define DSPI_SMEM_TIMING_CALI_S  1
/* DSPI_SMEM_TIMING_CLK_ENA : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: For sram, the bit is used to enable timing adjust clock for all reading operatio
ns..*/
#define DSPI_SMEM_TIMING_CLK_ENA    (BIT(0))
#define DSPI_SMEM_TIMING_CLK_ENA_M  (BIT(0))
#define DSPI_SMEM_TIMING_CLK_ENA_V  0x1
#define DSPI_SMEM_TIMING_CLK_ENA_S  0

#define DSPI_SMEM_DIN_MODE_REG          (DR_REG_DSPI_MEM_BASE + 0x194)
/* DSPI_SMEM_DINS_MODE : R/W ;bitpos:[26:24] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DINS_MODE    0x00000007
#define DSPI_SMEM_DINS_MODE_M  ((DSPI_SMEM_DINS_MODE_V)<<(DSPI_SMEM_DINS_MODE_S))
#define DSPI_SMEM_DINS_MODE_V  0x7
#define DSPI_SMEM_DINS_MODE_S  24
/* DSPI_SMEM_DIN7_MODE : R/W ;bitpos:[23:21] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN7_MODE    0x00000007
#define DSPI_SMEM_DIN7_MODE_M  ((DSPI_SMEM_DIN7_MODE_V)<<(DSPI_SMEM_DIN7_MODE_S))
#define DSPI_SMEM_DIN7_MODE_V  0x7
#define DSPI_SMEM_DIN7_MODE_S  21
/* DSPI_SMEM_DIN6_MODE : R/W ;bitpos:[20:18] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN6_MODE    0x00000007
#define DSPI_SMEM_DIN6_MODE_M  ((DSPI_SMEM_DIN6_MODE_V)<<(DSPI_SMEM_DIN6_MODE_S))
#define DSPI_SMEM_DIN6_MODE_V  0x7
#define DSPI_SMEM_DIN6_MODE_S  18
/* DSPI_SMEM_DIN5_MODE : R/W ;bitpos:[17:15] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN5_MODE    0x00000007
#define DSPI_SMEM_DIN5_MODE_M  ((DSPI_SMEM_DIN5_MODE_V)<<(DSPI_SMEM_DIN5_MODE_S))
#define DSPI_SMEM_DIN5_MODE_V  0x7
#define DSPI_SMEM_DIN5_MODE_S  15
/* DSPI_SMEM_DIN4_MODE : R/W ;bitpos:[14:12] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN4_MODE    0x00000007
#define DSPI_SMEM_DIN4_MODE_M  ((DSPI_SMEM_DIN4_MODE_V)<<(DSPI_SMEM_DIN4_MODE_S))
#define DSPI_SMEM_DIN4_MODE_V  0x7
#define DSPI_SMEM_DIN4_MODE_S  12
/* DSPI_SMEM_DIN3_MODE : R/W ;bitpos:[11:9] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN3_MODE    0x00000007
#define DSPI_SMEM_DIN3_MODE_M  ((DSPI_SMEM_DIN3_MODE_V)<<(DSPI_SMEM_DIN3_MODE_S))
#define DSPI_SMEM_DIN3_MODE_V  0x7
#define DSPI_SMEM_DIN3_MODE_S  9
/* DSPI_SMEM_DIN2_MODE : R/W ;bitpos:[8:6] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN2_MODE    0x00000007
#define DSPI_SMEM_DIN2_MODE_M  ((DSPI_SMEM_DIN2_MODE_V)<<(DSPI_SMEM_DIN2_MODE_S))
#define DSPI_SMEM_DIN2_MODE_V  0x7
#define DSPI_SMEM_DIN2_MODE_S  6
/* DSPI_SMEM_DIN1_MODE : R/W ;bitpos:[5:3] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN1_MODE    0x00000007
#define DSPI_SMEM_DIN1_MODE_M  ((DSPI_SMEM_DIN1_MODE_V)<<(DSPI_SMEM_DIN1_MODE_S))
#define DSPI_SMEM_DIN1_MODE_V  0x7
#define DSPI_SMEM_DIN1_MODE_S  3
/* DSPI_SMEM_DIN0_MODE : R/W ;bitpos:[2:0] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN0_MODE    0x00000007
#define DSPI_SMEM_DIN0_MODE_M  ((DSPI_SMEM_DIN0_MODE_V)<<(DSPI_SMEM_DIN0_MODE_S))
#define DSPI_SMEM_DIN0_MODE_V  0x7
#define DSPI_SMEM_DIN0_MODE_S  0

#define DSPI_SMEM_DIN_NUM_REG          (DR_REG_DSPI_MEM_BASE + 0x198)
/* DSPI_SMEM_DINS_NUM : R/W ;bitpos:[17:16] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DINS_NUM    0x00000003
#define DSPI_SMEM_DINS_NUM_M  ((DSPI_SMEM_DINS_NUM_V)<<(DSPI_SMEM_DINS_NUM_S))
#define DSPI_SMEM_DINS_NUM_V  0x3
#define DSPI_SMEM_DINS_NUM_S  16
/* DSPI_SMEM_DIN7_NUM : R/W ;bitpos:[15:14] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN7_NUM    0x00000003
#define DSPI_SMEM_DIN7_NUM_M  ((DSPI_SMEM_DIN7_NUM_V)<<(DSPI_SMEM_DIN7_NUM_S))
#define DSPI_SMEM_DIN7_NUM_V  0x3
#define DSPI_SMEM_DIN7_NUM_S  14
/* DSPI_SMEM_DIN6_NUM : R/W ;bitpos:[13:12] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN6_NUM    0x00000003
#define DSPI_SMEM_DIN6_NUM_M  ((DSPI_SMEM_DIN6_NUM_V)<<(DSPI_SMEM_DIN6_NUM_S))
#define DSPI_SMEM_DIN6_NUM_V  0x3
#define DSPI_SMEM_DIN6_NUM_S  12
/* DSPI_SMEM_DIN5_NUM : R/W ;bitpos:[11:10] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN5_NUM    0x00000003
#define DSPI_SMEM_DIN5_NUM_M  ((DSPI_SMEM_DIN5_NUM_V)<<(DSPI_SMEM_DIN5_NUM_S))
#define DSPI_SMEM_DIN5_NUM_V  0x3
#define DSPI_SMEM_DIN5_NUM_S  10
/* DSPI_SMEM_DIN4_NUM : R/W ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN4_NUM    0x00000003
#define DSPI_SMEM_DIN4_NUM_M  ((DSPI_SMEM_DIN4_NUM_V)<<(DSPI_SMEM_DIN4_NUM_S))
#define DSPI_SMEM_DIN4_NUM_V  0x3
#define DSPI_SMEM_DIN4_NUM_S  8
/* DSPI_SMEM_DIN3_NUM : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN3_NUM    0x00000003
#define DSPI_SMEM_DIN3_NUM_M  ((DSPI_SMEM_DIN3_NUM_V)<<(DSPI_SMEM_DIN3_NUM_S))
#define DSPI_SMEM_DIN3_NUM_V  0x3
#define DSPI_SMEM_DIN3_NUM_S  6
/* DSPI_SMEM_DIN2_NUM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN2_NUM    0x00000003
#define DSPI_SMEM_DIN2_NUM_M  ((DSPI_SMEM_DIN2_NUM_V)<<(DSPI_SMEM_DIN2_NUM_S))
#define DSPI_SMEM_DIN2_NUM_V  0x3
#define DSPI_SMEM_DIN2_NUM_S  4
/* DSPI_SMEM_DIN1_NUM : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN1_NUM    0x00000003
#define DSPI_SMEM_DIN1_NUM_M  ((DSPI_SMEM_DIN1_NUM_V)<<(DSPI_SMEM_DIN1_NUM_S))
#define DSPI_SMEM_DIN1_NUM_V  0x3
#define DSPI_SMEM_DIN1_NUM_S  2
/* DSPI_SMEM_DIN0_NUM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN0_NUM    0x00000003
#define DSPI_SMEM_DIN0_NUM_M  ((DSPI_SMEM_DIN0_NUM_V)<<(DSPI_SMEM_DIN0_NUM_S))
#define DSPI_SMEM_DIN0_NUM_V  0x3
#define DSPI_SMEM_DIN0_NUM_S  0

