espressif/esp-idf/components/soc/esp32p4/include/soc/dspi_mem_reg.h
#define DSPI_SMEM_DOUT_MODE_REG          (DR_REG_DSPI_MEM_BASE + 0x19C)
/* DSPI_SMEM_DOUTS_MODE : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUTS_MODE    (BIT(8))
#define DSPI_SMEM_DOUTS_MODE_M  (BIT(8))
#define DSPI_SMEM_DOUTS_MODE_V  0x1
#define DSPI_SMEM_DOUTS_MODE_S  8
/* DSPI_SMEM_DOUT7_MODE : R/W ;bitpos:[7] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT7_MODE    (BIT(7))
#define DSPI_SMEM_DOUT7_MODE_M  (BIT(7))
#define DSPI_SMEM_DOUT7_MODE_V  0x1
#define DSPI_SMEM_DOUT7_MODE_S  7
/* DSPI_SMEM_DOUT6_MODE : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT6_MODE    (BIT(6))
#define DSPI_SMEM_DOUT6_MODE_M  (BIT(6))
#define DSPI_SMEM_DOUT6_MODE_V  0x1
#define DSPI_SMEM_DOUT6_MODE_S  6
/* DSPI_SMEM_DOUT5_MODE : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT5_MODE    (BIT(5))
#define DSPI_SMEM_DOUT5_MODE_M  (BIT(5))
#define DSPI_SMEM_DOUT5_MODE_V  0x1
#define DSPI_SMEM_DOUT5_MODE_S  5
/* DSPI_SMEM_DOUT4_MODE : R/W ;bitpos:[4] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT4_MODE    (BIT(4))
#define DSPI_SMEM_DOUT4_MODE_M  (BIT(4))
#define DSPI_SMEM_DOUT4_MODE_V  0x1
#define DSPI_SMEM_DOUT4_MODE_S  4
/* DSPI_SMEM_DOUT3_MODE : R/W ;bitpos:[3] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT3_MODE    (BIT(3))
#define DSPI_SMEM_DOUT3_MODE_M  (BIT(3))
#define DSPI_SMEM_DOUT3_MODE_V  0x1
#define DSPI_SMEM_DOUT3_MODE_S  3
/* DSPI_SMEM_DOUT2_MODE : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT2_MODE    (BIT(2))
#define DSPI_SMEM_DOUT2_MODE_M  (BIT(2))
#define DSPI_SMEM_DOUT2_MODE_V  0x1
#define DSPI_SMEM_DOUT2_MODE_S  2
/* DSPI_SMEM_DOUT1_MODE : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT1_MODE    (BIT(1))
#define DSPI_SMEM_DOUT1_MODE_M  (BIT(1))
#define DSPI_SMEM_DOUT1_MODE_V  0x1
#define DSPI_SMEM_DOUT1_MODE_S  1
/* DSPI_SMEM_DOUT0_MODE : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT0_MODE    (BIT(0))
#define DSPI_SMEM_DOUT0_MODE_M  (BIT(0))
#define DSPI_SMEM_DOUT0_MODE_V  0x1
#define DSPI_SMEM_DOUT0_MODE_S  0

#define DSPI_SMEM_AC_REG          (DR_REG_DSPI_MEM_BASE + 0x1A0)
/* DSPI_SMEM_SPLIT_TRANS_EN : R/W ;bitpos:[31] ;default: 1'b1 ; */
/*description: Set this bit to enable SPI0 split one AXI accesses EXT_RAM transfer into two SPI
 transfers when one transfer will cross flash/EXT_RAM page corner, valid no matt
er whether there is an ECC region or not..*/
#define DSPI_SMEM_SPLIT_TRANS_EN    (BIT(31))
#define DSPI_SMEM_SPLIT_TRANS_EN_M  (BIT(31))
#define DSPI_SMEM_SPLIT_TRANS_EN_V  0x1
#define DSPI_SMEM_SPLIT_TRANS_EN_S  31
/* DSPI_SMEM_CS_HOLD_DELAY : R/W ;bitpos:[30:25] ;default: 6'd0 ; */
/*description: These bits are used to set the minimum CS high time tSHSL between SPI burst tran
sfer when accesses to external RAM. tSHSL is (SPI_SMEM_CS_HOLD_DELAY[5:0] + 1) M
SPI core clock cycles..*/
#define DSPI_SMEM_CS_HOLD_DELAY    0x0000003F
#define DSPI_SMEM_CS_HOLD_DELAY_M  ((DSPI_SMEM_CS_HOLD_DELAY_V)<<(DSPI_SMEM_CS_HOLD_DELAY_S))
#define DSPI_SMEM_CS_HOLD_DELAY_V  0x3F
#define DSPI_SMEM_CS_HOLD_DELAY_S  25
/* DSPI_SMEM_ECC_16TO18_BYTE_EN : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: Set this bit to enable SPI0 and SPI1 ECC 16 bytes data with 2 ECC bytes mode whe
n accesses external RAM..*/
#define DSPI_SMEM_ECC_16TO18_BYTE_EN    (BIT(16))
#define DSPI_SMEM_ECC_16TO18_BYTE_EN_M  (BIT(16))
#define DSPI_SMEM_ECC_16TO18_BYTE_EN_V  0x1
#define DSPI_SMEM_ECC_16TO18_BYTE_EN_S  16
/* DSPI_SMEM_ECC_SKIP_PAGE_CORNER : R/W ;bitpos:[15] ;default: 1'b1 ; */
/*description: 1: SPI0 skips page corner when accesses external RAM. 0: Not skip page corner wh
en accesses external RAM..*/
#define DSPI_SMEM_ECC_SKIP_PAGE_CORNER    (BIT(15))
#define DSPI_SMEM_ECC_SKIP_PAGE_CORNER_M  (BIT(15))
#define DSPI_SMEM_ECC_SKIP_PAGE_CORNER_V  0x1
#define DSPI_SMEM_ECC_SKIP_PAGE_CORNER_S  15
/* DSPI_SMEM_ECC_CS_HOLD_TIME : R/W ;bitpos:[14:12] ;default: 3'd3 ; */
/*description: SPI_SMEM_CS_HOLD_TIME + SPI_SMEM_ECC_CS_HOLD_TIME is the SPI0 and SPI1 CS hold c
ycles in ECC mode when accessed external RAM..*/
#define DSPI_SMEM_ECC_CS_HOLD_TIME    0x00000007
#define DSPI_SMEM_ECC_CS_HOLD_TIME_M  ((DSPI_SMEM_ECC_CS_HOLD_TIME_V)<<(DSPI_SMEM_ECC_CS_HOLD_TIME_S))
#define DSPI_SMEM_ECC_CS_HOLD_TIME_V  0x7
#define DSPI_SMEM_ECC_CS_HOLD_TIME_S  12
/* DSPI_SMEM_CS_HOLD_TIME : R/W ;bitpos:[11:7] ;default: 5'h1 ; */
/*description: For SPI0 and SPI1, spi cs signal is delayed to inactive by spi clock this bits a
re combined with spi_mem_cs_hold bit..*/
#define DSPI_SMEM_CS_HOLD_TIME    0x0000001F
#define DSPI_SMEM_CS_HOLD_TIME_M  ((DSPI_SMEM_CS_HOLD_TIME_V)<<(DSPI_SMEM_CS_HOLD_TIME_S))
#define DSPI_SMEM_CS_HOLD_TIME_V  0x1F
#define DSPI_SMEM_CS_HOLD_TIME_S  7
/* DSPI_SMEM_CS_SETUP_TIME : R/W ;bitpos:[6:2] ;default: 5'h1 ; */
/*description: For spi0, (cycles-1) of prepare phase by spi clock this bits are combined with s
pi_mem_cs_setup bit..*/
#define DSPI_SMEM_CS_SETUP_TIME    0x0000001F
#define DSPI_SMEM_CS_SETUP_TIME_M  ((DSPI_SMEM_CS_SETUP_TIME_V)<<(DSPI_SMEM_CS_SETUP_TIME_S))
#define DSPI_SMEM_CS_SETUP_TIME_V  0x1F
#define DSPI_SMEM_CS_SETUP_TIME_S  2
/* DSPI_SMEM_CS_HOLD : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: For SPI0 and SPI1, spi cs keep low when spi is in done phase. 1: enable 0: disab
le..*/
#define DSPI_SMEM_CS_HOLD    (BIT(1))
#define DSPI_SMEM_CS_HOLD_M  (BIT(1))
#define DSPI_SMEM_CS_HOLD_V  0x1
#define DSPI_SMEM_CS_HOLD_S  1
/* DSPI_SMEM_CS_SETUP : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: For SPI0 and SPI1, spi cs is enable when spi is in prepare phase. 1: enable 0: d
isable..*/
#define DSPI_SMEM_CS_SETUP    (BIT(0))
#define DSPI_SMEM_CS_SETUP_M  (BIT(0))
#define DSPI_SMEM_CS_SETUP_V  0x1
#define DSPI_SMEM_CS_SETUP_S  0

