espressif/esp-idf/components/soc/esp32p4/include/soc/dspi_mem_reg.h
#define DSPI_SMEM_DIN_HEX_MODE_REG          (DR_REG_DSPI_MEM_BASE + 0x1A4)
/* DSPI_SMEM_DINS_HEX_MODE : R/W ;bitpos:[26:24] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DINS_HEX_MODE    0x00000007
#define DSPI_SMEM_DINS_HEX_MODE_M  ((DSPI_SMEM_DINS_HEX_MODE_V)<<(DSPI_SMEM_DINS_HEX_MODE_S))
#define DSPI_SMEM_DINS_HEX_MODE_V  0x7
#define DSPI_SMEM_DINS_HEX_MODE_S  24
/* DSPI_SMEM_DIN15_MODE : R/W ;bitpos:[23:21] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN15_MODE    0x00000007
#define DSPI_SMEM_DIN15_MODE_M  ((DSPI_SMEM_DIN15_MODE_V)<<(DSPI_SMEM_DIN15_MODE_S))
#define DSPI_SMEM_DIN15_MODE_V  0x7
#define DSPI_SMEM_DIN15_MODE_S  21
/* DSPI_SMEM_DIN14_MODE : R/W ;bitpos:[20:18] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN14_MODE    0x00000007
#define DSPI_SMEM_DIN14_MODE_M  ((DSPI_SMEM_DIN14_MODE_V)<<(DSPI_SMEM_DIN14_MODE_S))
#define DSPI_SMEM_DIN14_MODE_V  0x7
#define DSPI_SMEM_DIN14_MODE_S  18
/* DSPI_SMEM_DIN13_MODE : R/W ;bitpos:[17:15] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN13_MODE    0x00000007
#define DSPI_SMEM_DIN13_MODE_M  ((DSPI_SMEM_DIN13_MODE_V)<<(DSPI_SMEM_DIN13_MODE_S))
#define DSPI_SMEM_DIN13_MODE_V  0x7
#define DSPI_SMEM_DIN13_MODE_S  15
/* DSPI_SMEM_DIN12_MODE : R/W ;bitpos:[14:12] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN12_MODE    0x00000007
#define DSPI_SMEM_DIN12_MODE_M  ((DSPI_SMEM_DIN12_MODE_V)<<(DSPI_SMEM_DIN12_MODE_S))
#define DSPI_SMEM_DIN12_MODE_V  0x7
#define DSPI_SMEM_DIN12_MODE_S  12
/* DSPI_SMEM_DIN11_MODE : R/W ;bitpos:[11:9] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN11_MODE    0x00000007
#define DSPI_SMEM_DIN11_MODE_M  ((DSPI_SMEM_DIN11_MODE_V)<<(DSPI_SMEM_DIN11_MODE_S))
#define DSPI_SMEM_DIN11_MODE_V  0x7
#define DSPI_SMEM_DIN11_MODE_S  9
/* DSPI_SMEM_DIN10_MODE : R/W ;bitpos:[8:6] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN10_MODE    0x00000007
#define DSPI_SMEM_DIN10_MODE_M  ((DSPI_SMEM_DIN10_MODE_V)<<(DSPI_SMEM_DIN10_MODE_S))
#define DSPI_SMEM_DIN10_MODE_V  0x7
#define DSPI_SMEM_DIN10_MODE_S  6
/* DSPI_SMEM_DIN09_MODE : R/W ;bitpos:[5:3] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN09_MODE    0x00000007
#define DSPI_SMEM_DIN09_MODE_M  ((DSPI_SMEM_DIN09_MODE_V)<<(DSPI_SMEM_DIN09_MODE_S))
#define DSPI_SMEM_DIN09_MODE_V  0x7
#define DSPI_SMEM_DIN09_MODE_S  3
/* DSPI_SMEM_DIN08_MODE : R/W ;bitpos:[2:0] ;default: 3'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: input without delayed,
1: input with the posedge of clk_apb,2 input with the negedge of clk_apb,  3: in
put with the posedge of clk_160, 4 input with the negedge of clk_160, 5: input w
ith the spi_clk high edge,  6: input with the spi_clk low edge.*/
#define DSPI_SMEM_DIN08_MODE    0x00000007
#define DSPI_SMEM_DIN08_MODE_M  ((DSPI_SMEM_DIN08_MODE_V)<<(DSPI_SMEM_DIN08_MODE_S))
#define DSPI_SMEM_DIN08_MODE_V  0x7
#define DSPI_SMEM_DIN08_MODE_S  0

#define DSPI_SMEM_DIN_HEX_NUM_REG          (DR_REG_DSPI_MEM_BASE + 0x1A8)
/* DSPI_SMEM_DINS_HEX_NUM : R/W ;bitpos:[17:16] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DINS_HEX_NUM    0x00000003
#define DSPI_SMEM_DINS_HEX_NUM_M  ((DSPI_SMEM_DINS_HEX_NUM_V)<<(DSPI_SMEM_DINS_HEX_NUM_S))
#define DSPI_SMEM_DINS_HEX_NUM_V  0x3
#define DSPI_SMEM_DINS_HEX_NUM_S  16
/* DSPI_SMEM_DIN15_NUM : R/W ;bitpos:[15:14] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN15_NUM    0x00000003
#define DSPI_SMEM_DIN15_NUM_M  ((DSPI_SMEM_DIN15_NUM_V)<<(DSPI_SMEM_DIN15_NUM_S))
#define DSPI_SMEM_DIN15_NUM_V  0x3
#define DSPI_SMEM_DIN15_NUM_S  14
/* DSPI_SMEM_DIN14_NUM : R/W ;bitpos:[13:12] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN14_NUM    0x00000003
#define DSPI_SMEM_DIN14_NUM_M  ((DSPI_SMEM_DIN14_NUM_V)<<(DSPI_SMEM_DIN14_NUM_S))
#define DSPI_SMEM_DIN14_NUM_V  0x3
#define DSPI_SMEM_DIN14_NUM_S  12
/* DSPI_SMEM_DIN13_NUM : R/W ;bitpos:[11:10] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN13_NUM    0x00000003
#define DSPI_SMEM_DIN13_NUM_M  ((DSPI_SMEM_DIN13_NUM_V)<<(DSPI_SMEM_DIN13_NUM_S))
#define DSPI_SMEM_DIN13_NUM_V  0x3
#define DSPI_SMEM_DIN13_NUM_S  10
/* DSPI_SMEM_DIN12_NUM : R/W ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN12_NUM    0x00000003
#define DSPI_SMEM_DIN12_NUM_M  ((DSPI_SMEM_DIN12_NUM_V)<<(DSPI_SMEM_DIN12_NUM_S))
#define DSPI_SMEM_DIN12_NUM_V  0x3
#define DSPI_SMEM_DIN12_NUM_S  8
/* DSPI_SMEM_DIN11_NUM : R/W ;bitpos:[7:6] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN11_NUM    0x00000003
#define DSPI_SMEM_DIN11_NUM_M  ((DSPI_SMEM_DIN11_NUM_V)<<(DSPI_SMEM_DIN11_NUM_S))
#define DSPI_SMEM_DIN11_NUM_V  0x3
#define DSPI_SMEM_DIN11_NUM_S  6
/* DSPI_SMEM_DIN10_NUM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN10_NUM    0x00000003
#define DSPI_SMEM_DIN10_NUM_M  ((DSPI_SMEM_DIN10_NUM_V)<<(DSPI_SMEM_DIN10_NUM_S))
#define DSPI_SMEM_DIN10_NUM_V  0x3
#define DSPI_SMEM_DIN10_NUM_S  4
/* DSPI_SMEM_DIN09_NUM : R/W ;bitpos:[3:2] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN09_NUM    0x00000003
#define DSPI_SMEM_DIN09_NUM_M  ((DSPI_SMEM_DIN09_NUM_V)<<(DSPI_SMEM_DIN09_NUM_S))
#define DSPI_SMEM_DIN09_NUM_V  0x3
#define DSPI_SMEM_DIN09_NUM_S  2
/* DSPI_SMEM_DIN08_NUM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
delayed by 2 cycles,....*/
#define DSPI_SMEM_DIN08_NUM    0x00000003
#define DSPI_SMEM_DIN08_NUM_M  ((DSPI_SMEM_DIN08_NUM_V)<<(DSPI_SMEM_DIN08_NUM_S))
#define DSPI_SMEM_DIN08_NUM_V  0x3
#define DSPI_SMEM_DIN08_NUM_S  0

