espressif/esp-idf/components/soc/esp32p4/include/soc/dspi_mem_reg.h
#define DSPI_SMEM_DOUT_HEX_MODE_REG          (DR_REG_DSPI_MEM_BASE + 0x1AC)
/* DSPI_SMEM_DOUTS_HEX_MODE : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUTS_HEX_MODE    (BIT(8))
#define DSPI_SMEM_DOUTS_HEX_MODE_M  (BIT(8))
#define DSPI_SMEM_DOUTS_HEX_MODE_V  0x1
#define DSPI_SMEM_DOUTS_HEX_MODE_S  8
/* DSPI_SMEM_DOUT15_MODE : R/W ;bitpos:[7] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT15_MODE    (BIT(7))
#define DSPI_SMEM_DOUT15_MODE_M  (BIT(7))
#define DSPI_SMEM_DOUT15_MODE_V  0x1
#define DSPI_SMEM_DOUT15_MODE_S  7
/* DSPI_SMEM_DOUT14_MODE : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT14_MODE    (BIT(6))
#define DSPI_SMEM_DOUT14_MODE_M  (BIT(6))
#define DSPI_SMEM_DOUT14_MODE_V  0x1
#define DSPI_SMEM_DOUT14_MODE_S  6
/* DSPI_SMEM_DOUT13_MODE : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT13_MODE    (BIT(5))
#define DSPI_SMEM_DOUT13_MODE_M  (BIT(5))
#define DSPI_SMEM_DOUT13_MODE_V  0x1
#define DSPI_SMEM_DOUT13_MODE_S  5
/* DSPI_SMEM_DOUT12_MODE : R/W ;bitpos:[4] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT12_MODE    (BIT(4))
#define DSPI_SMEM_DOUT12_MODE_M  (BIT(4))
#define DSPI_SMEM_DOUT12_MODE_V  0x1
#define DSPI_SMEM_DOUT12_MODE_S  4
/* DSPI_SMEM_DOUT11_MODE : R/W ;bitpos:[3] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT11_MODE    (BIT(3))
#define DSPI_SMEM_DOUT11_MODE_M  (BIT(3))
#define DSPI_SMEM_DOUT11_MODE_V  0x1
#define DSPI_SMEM_DOUT11_MODE_S  3
/* DSPI_SMEM_DOUT10_MODE : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT10_MODE    (BIT(2))
#define DSPI_SMEM_DOUT10_MODE_M  (BIT(2))
#define DSPI_SMEM_DOUT10_MODE_V  0x1
#define DSPI_SMEM_DOUT10_MODE_S  2
/* DSPI_SMEM_DOUT09_MODE : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT09_MODE    (BIT(1))
#define DSPI_SMEM_DOUT09_MODE_M  (BIT(1))
#define DSPI_SMEM_DOUT09_MODE_V  0x1
#define DSPI_SMEM_DOUT09_MODE_S  1
/* DSPI_SMEM_DOUT08_MODE : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define DSPI_SMEM_DOUT08_MODE    (BIT(0))
#define DSPI_SMEM_DOUT08_MODE_M  (BIT(0))
#define DSPI_SMEM_DOUT08_MODE_V  0x1
#define DSPI_SMEM_DOUT08_MODE_S  0

#define DSPI_MEM_CLOCK_GATE_REG          (DR_REG_DSPI_MEM_BASE + 0x200)
/* DSPI_MEM_SPI_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: Register clock gate enable signal. 1: Enable. 0: Disable..*/
#define DSPI_MEM_SPI_CLK_EN    (BIT(0))
#define DSPI_MEM_SPI_CLK_EN_M  (BIT(0))
#define DSPI_MEM_SPI_CLK_EN_V  0x1
#define DSPI_MEM_SPI_CLK_EN_S  0

#define DSPI_MEM_XTS_PLAIN_BASE_REG          (DR_REG_DSPI_MEM_BASE + 0x300)
/* DSPI_MEM_SPI_XTS_PLAIN : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This field is only used to generate include file in c case. This field is useles
s. Please do not use this field..*/
#define DSPI_MEM_SPI_XTS_PLAIN    0xFFFFFFFF
#define DSPI_MEM_SPI_XTS_PLAIN_M  ((DSPI_MEM_SPI_XTS_PLAIN_V)<<(DSPI_MEM_SPI_XTS_PLAIN_S))
#define DSPI_MEM_SPI_XTS_PLAIN_V  0xFFFFFFFF
#define DSPI_MEM_SPI_XTS_PLAIN_S  0

#define DSPI_MEM_XTS_LINESIZE_REG          (DR_REG_DSPI_MEM_BASE + 0x340)
/* DSPI_MEM_SPI_XTS_LINESIZE : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: This bits stores the line-size parameter which will be used in manual encryption
 calculation. It decides how many bytes will be encrypted one time. 0: 16-bytes,
 1: 32-bytes, 2: 64-bytes, 3:reserved..*/
#define DSPI_MEM_SPI_XTS_LINESIZE    0x00000003
#define DSPI_MEM_SPI_XTS_LINESIZE_M  ((DSPI_MEM_SPI_XTS_LINESIZE_V)<<(DSPI_MEM_SPI_XTS_LINESIZE_S))
#define DSPI_MEM_SPI_XTS_LINESIZE_V  0x3
#define DSPI_MEM_SPI_XTS_LINESIZE_S  0

#define DSPI_MEM_XTS_DESTINATION_REG          (DR_REG_DSPI_MEM_BASE + 0x344)
/* DSPI_MEM_SPI_XTS_DESTINATION : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: This bit stores the destination parameter which will be used in manual encryptio
n calculation. 0: flash(default), 1: psram(reserved). Only default value can be
used..*/
#define DSPI_MEM_SPI_XTS_DESTINATION    (BIT(0))
#define DSPI_MEM_SPI_XTS_DESTINATION_M  (BIT(0))
#define DSPI_MEM_SPI_XTS_DESTINATION_V  0x1
#define DSPI_MEM_SPI_XTS_DESTINATION_S  0

#define DSPI_MEM_XTS_PHYSICAL_ADDRESS_REG          (DR_REG_DSPI_MEM_BASE + 0x348)
/* DSPI_MEM_SPI_XTS_PHYSICAL_ADDRESS : R/W ;bitpos:[25:0] ;default: 26'h0 ; */
/*description: This bits stores the physical-address parameter which will be used in manual enc
ryption calculation. This value should aligned with byte number decided by line-
size parameter..*/
#define DSPI_MEM_SPI_XTS_PHYSICAL_ADDRESS    0x03FFFFFF
#define DSPI_MEM_SPI_XTS_PHYSICAL_ADDRESS_M  ((DSPI_MEM_SPI_XTS_PHYSICAL_ADDRESS_V)<<(DSPI_MEM_SPI_XTS_PHYSICAL_ADDRESS_S))
#define DSPI_MEM_SPI_XTS_PHYSICAL_ADDRESS_V  0x3FFFFFF
#define DSPI_MEM_SPI_XTS_PHYSICAL_ADDRESS_S  0

